{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "CSS-Tricks",
      "feedUrl": "https://css-tricks.com/feed/",
      "siteUrl": "https://css-tricks.com",
      "articles": [
        {
          "id": "https://css-tricks.com/?p=351402",
          "author": "Chris Coyier",
          "description": "There is a working draft spec for CSS scoping now, a newsworthy event for the W3C. Other than a weird period where <style scoped shipped and then was subsequently removed from the spec (and browsers), this is the furthest a …\nThe post Early Days for CSS Scoping appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/early-days-for-css-scoping/",
          "publishedOn": "2021-09-06T18:47:19.000Z",
          "wordCount": 724,
          "title": "Early Days for CSS Scoping"
        },
        {
          "id": "https://css-tricks.com/?p=350649",
          "author": "Chris Coyier",
          "description": "I’d say cloud functions are one of the most transformative technologies in the last bunch of years. They are (usually) cheap, scale well, secure in their inherit isolation, and often written in JavaScript—comfortable territory for front-end developers. Nearly every cloud …\nThe post AWS Lambdas: Easy, Easier, Easiest appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://joeyanuff-33180.medium.com/aws-lambdas-easy-easier-easiest-823e71c02bd9",
          "publishedOn": "2021-09-03T22:16:47.000Z",
          "wordCount": 930,
          "title": "AWS Lambdas: Easy, Easier, Easiest"
        },
        {
          "id": "https://css-tricks.com/?p=350889",
          "author": "John Rhea",
          "description": "We’ve already discussed how creating web components is easier than you think, but there’s another aspect of the specification that we haven’t discussed yet and it’s a way to customize (nay, supercharge) a built-in element. It’s similar to …\nThe post Supercharging Built-In Elements With Web Components “is” Easier Than You Think appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/supercharging-built-in-elements-with-web-components-is-easier-than-you-think/",
          "publishedOn": "2021-09-03T14:21:38.000Z",
          "wordCount": 1852,
          "title": "Supercharging Built-In Elements With Web Components “is” Easier Than You Think"
        },
        {
          "id": "https://css-tricks.com/?p=350934",
          "author": "Chris Coyier",
          "description": "HTTP Caching is a Superpower — Hugh Haworth covers how the Cache-Control header is an awfully potent ingredient in web performance. I mis-read the title at first and was waiting to read about HTML caching. Hugh covers it a bit \n…\nThe post Links on Performance IV appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/links-on-performance-iv/",
          "publishedOn": "2021-09-02T22:28:51.000Z",
          "wordCount": 844,
          "title": "Links on Performance IV"
        },
        {
          "id": "https://css-tricks.com/?p=350723",
          "author": "Chris Coyier",
          "description": "Have you ever fretted that front-end web development moves so fast that if you stepped away for a while, you’d be lost coming back? Rachel Smith has:\nThe hectic pace of needing to learn one thing after the next \n…\nThe post I completely ignored the front-end development scene for 6 months. It was fine. appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://rachsmith.com/i-completely-ignored-the-front-end-development-scene-for-6-months-it-was-fine/",
          "publishedOn": "2021-09-02T22:26:36.000Z",
          "wordCount": 599,
          "title": "I completely ignored the front-end development scene for 6 months. It was fine."
        },
        {
          "id": "https://css-tricks.com/?p=350830",
          "author": "Chris Coyier",
          "description": "Zach did that thing where each of his blog posts has a special URL with the design of social image card that is screenshat by a headless browser (like Puppeteer) and used as a true meta Open Graph image, meaning …\nThe post If I work really hard on my Open Graph images, people will share my blog posts. appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.zachleat.com/web/automatic-opengraph/",
          "publishedOn": "2021-09-02T14:30:55.000Z",
          "wordCount": 1607,
          "title": "If I work really hard on my Open Graph images, people will share my blog posts."
        },
        {
          "id": "https://css-tricks.com/?p=351172",
          "author": "Tharaka Romesh",
          "description": "(This is a sponsored post.)\nStatic site generators are popular for their speed, security, and user experience. However, sometimes your application needs data that is not available when the site is built. React is a library for building user …\nThe post Accessing Your Data With Netlify Functions and React appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/accessing-data-netlify-functions-react/",
          "publishedOn": "2021-09-02T00:28:22.000Z",
          "wordCount": 3095,
          "title": "Accessing Your Data With Netlify Functions and React"
        },
        {
          "id": "https://css-tricks.com/?p=350752",
          "author": "Chris Coyier",
          "description": "Nathan Hardy shares when things “clicked”:\nReflecting back on this time, I think there are a few key concepts that were vital to things finally all making sense and fitting together. These were:\n• The Box Model (e.g. box-sizing, height, width, margin, padding)\n• Layout \n…\nThe post What I Wish I Knew About CSS When Starting Out As A Front-Ender appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://engineering.kablamo.com.au/posts/2021/my-first-css",
          "publishedOn": "2021-09-01T23:25:45.000Z",
          "wordCount": 1194,
          "title": "What I Wish I Knew About CSS When Starting Out As A Front-Ender"
        },
        {
          "id": "https://css-tricks.com/?p=350569",
          "author": "Chris Coyier",
          "description": "All-things-typography, from a hard-edged monospaced variable font to fonts in the \"Twilight Zone\" ... and much, much more.\nThe post Some Typography Links VII appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/some-typography-links-vii/",
          "publishedOn": "2021-09-01T14:37:38.000Z",
          "wordCount": 800,
          "title": "Some Typography Links VII"
        },
        {
          "id": "https://css-tricks.com/?p=350788",
          "author": "Chris Coyier",
          "description": "I think this is good advice from Silvestar Bistrović:\nAn enabling selector is what I call a selector that does a job without disabling the particular rule.\nThe classic example is applying margin to everything, only to have to remove …\nThe post You want enabling CSS selectors, not disabling ones appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.silvestar.codes/articles/you-want-a-single-enabling-selector-not-the-one-that-disables-the-rule-of-the-previous-one/",
          "publishedOn": "2021-08-31T20:17:25.000Z",
          "wordCount": 374,
          "title": "You want enabling CSS selectors, not disabling ones"
        },
        {
          "id": "https://css-tricks.com/?p=350690",
          "author": "Chris Coyier",
          "description": "You know like https:? That’s a URL Scheme. You’re probably familiar with the concept, thanks to others that come up in front-end development, like mailto:. You can actually make your own, which is pretty cool. There …\nThe post Application-Specific Links appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/application-specific-links/",
          "publishedOn": "2021-08-31T14:30:21.000Z",
          "wordCount": 1042,
          "title": "Application-Specific Links"
        },
        {
          "id": "https://css-tricks.com/?p=350670",
          "author": "Geoff Graham",
          "description": "A bonafide CSS trick if there ever was one! @ShadowShahriar created a CodePen demo that uses pseudo-elements to place commas between list items that are displayed inline, and the result is a natural-looking complete sentence with proper punctuation.\nCodePen Embed…\nThe post CSS Pseudo Commas appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://codepen.io/ShadowShahriar/pen/LYyvVjo",
          "publishedOn": "2021-08-30T21:20:00.000Z",
          "wordCount": null,
          "title": "CSS Pseudo Commas"
        },
        {
          "id": "https://css-tricks.com/?p=350574",
          "author": "Temani Afif",
          "description": "After the fragmentation effect, I am going to tackle another interesting animation: the blob! We all agree that such effect is hard to achieve with CSS, so we generally reach for SVG to make those gooey shapes. But …\nThe post Exploring the CSS Paint API: Blob Animation appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/exploring-the-css-paint-api-blob-animation/",
          "publishedOn": "2021-08-30T14:43:42.000Z",
          "wordCount": 4281,
          "title": "Exploring the CSS Paint API: Blob Animation"
        },
        {
          "id": "https://css-tricks.com/?p=350782",
          "author": "Chris Coyier",
          "description": "That’s a heartwrenching title from Michael Williamson. I believe it though. It’s kinda like a maximized version of the blogging phenomenon where if you work on a post for weeks it’ll flop compared to a post that’s some dumb 20-minute …\nThe post My tiny side project has had more impact than my decade in the software industry appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://mike.zwobble.org/2021/08/side-projects-vs-industry/",
          "publishedOn": "2021-08-27T19:14:10.000Z",
          "wordCount": 738,
          "title": "My tiny side project has had more impact than my decade in the software industry"
        },
        {
          "id": "https://css-tricks.com/?p=350201",
          "author": "Murtuzaali Surti",
          "description": "What options do you have if you want the body background in a fixed position where it stays put on scroll? background-attachment: fixed in CSS, at best, does not work well in mobile browsers, and at worst is not even …\nThe post The Fixed Background Attachment Hack appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/the-fixed-background-attachment-hack/",
          "publishedOn": "2021-08-27T14:42:16.000Z",
          "wordCount": 1637,
          "title": "The Fixed Background Attachment Hack"
        },
        {
          "id": "https://css-tricks.com/?p=350573",
          "author": "Chris Coyier",
          "description": "When I think about what front-end development really is and feels like, this is at the heart of it: designing around a huge set of unknowns, and really embracing that notion as a strength of the web rather …\nThe post Designing for the Unexpected appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://alistapart.com/article/designing-for-the-unexpected/",
          "publishedOn": "2021-08-26T23:07:31.000Z",
          "wordCount": 4512,
          "title": "Designing for the Unexpected"
        },
        {
          "id": "https://css-tricks.com/?p=350298",
          "author": "Chris Coyier",
          "description": "The perfect link — Rian Rietveld defines them: “When you click on them, they take you somewhere else.” Not much code in here (we’ve got that), just a lot of practical accessibility advice. For example, the alt text \n…\nThe post Some Articles About Accessibility I’ve Saved Recently III appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/some-articles-about-accessibility-ive-saved-recently-iii/",
          "publishedOn": "2021-08-26T19:35:21.000Z",
          "wordCount": 843,
          "title": "Some Articles About Accessibility I’ve Saved Recently III"
        },
        {
          "id": "https://css-tricks.com/?p=350223",
          "author": "Mariana Beldi",
          "description": "While learning Vue.js, I started building free web tools that involved the exploration of SVG, with the goal of learning something about both! Let’s take a look at one of those tools: a generator that makes SVG loaders and …\nThe post How I Made a Generator for SVG Loaders With Sass and SMIL Options appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-i-made-a-generator-for-svg-loaders-with-sass-and-smil-options/",
          "publishedOn": "2021-08-26T14:35:03.000Z",
          "wordCount": 2061,
          "title": "How I Made a Generator for SVG Loaders With Sass and SMIL Options"
        },
        {
          "id": "https://css-tricks.com/?p=350311",
          "author": "Chris Coyier",
          "description": "A question:\nIf you copy a code sample that uses two-space indentation and you want to convert it to four-space indentation, what’s the *fastest* and easiest option?\nMatt Stauffer, Twitter\n\nI wrote about doing this in Sublime Text a …\nThe post One Way to Convert Code Indentation appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/one-way-to-convert-code-indentation/",
          "publishedOn": "2021-08-25T22:34:04.000Z",
          "wordCount": 695,
          "title": "One Way to Convert Code Indentation"
        },
        {
          "id": "https://css-tricks.com/?p=346612",
          "author": "Eli Penner",
          "description": "Today’s websites are overflowing with animations—often too many. They get in the way of the content and slow down our busy users. But at the same time: they’re wonderful. They bring websites to life, are fun to implement and …\nThe post Stealing Game Animation Techniques to Engage Users appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/stealing-game-animation-techniques-to-engage-users/",
          "publishedOn": "2021-08-25T14:55:17.000Z",
          "wordCount": 2905,
          "title": "Stealing Game Animation Techniques to Engage Users"
        },
        {
          "id": "https://css-tricks.com/?p=350486",
          "author": "Chris Coyier",
          "description": "This is a bit of advice for developers on Macs I’ve heard quite a few times, and I’ll echo it: go into System Preferences > General > Show scroll bars and set to always. This isn’t about you, it’s …\nThe post Scrollbar Reflowing appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/scrollbar-reflowing/",
          "publishedOn": "2021-08-24T19:13:30.000Z",
          "wordCount": 693,
          "title": "Scrollbar Reflowing"
        },
        {
          "id": "https://css-tricks.com/?p=350253",
          "author": "Chris Coyier",
          "description": "(This is a sponsored post.)\nFree event hosted by Netlify coming up next week (Wednesday, August 25th): Architecting with Next.js. It’s just a little half-day thing. No brainer.\nJoin us for a special event where we’ll highlight business \n…\nThe post Architecting With Next.js appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.netlify.com/events/architecting-with-nextjs",
          "publishedOn": "2021-08-24T19:12:23.000Z",
          "wordCount": 441,
          "title": "Architecting With Next.js"
        },
        {
          "id": "https://css-tricks.com/?p=346597",
          "author": "Charlie Gerard",
          "description": "Solid is a reactive JavaScript library for creating user interfaces without a virtual DOM. It compiles templates down to real DOM nodes once and wraps updates in fine-grained reactions so that when state updates, only the related code runs.\nThis …\nThe post Introduction to the Solid JavaScript Library appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/introduction-to-the-solid-javascript-library/",
          "publishedOn": "2021-08-24T14:30:50.000Z",
          "wordCount": 1860,
          "title": "Introduction to the Solid JavaScript Library"
        },
        {
          "id": "https://css-tricks.com/?p=350264",
          "author": "Chris Coyier",
          "description": "You can’t just do @media (prefers-reduced-data: no-preference) alone because, as Kilian Valkhof says:\n[…] that would be false if either there was no support (since the browser wouldn’t understand the media query) or if it was supported but the \n…\nThe post Detecting Media Query Support in CSS and JavaScript appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://kilianvalkhof.com/2021/web/detecting-media-query-support-in-css-and-javascript/",
          "publishedOn": "2021-08-23T17:16:38.000Z",
          "wordCount": 1292,
          "title": "Detecting Media Query Support in CSS and JavaScript"
        },
        {
          "id": "https://css-tricks.com/?p=350160",
          "author": "Chris Coyier",
          "description": "We can update the URL in JavaScript. We’ve got the APIs pushState and replaceState: \n// Adds to browser history\nhistory.pushState({}, \"About Page\", \"/about\");\n\n// Doesn't\nhistory.replaceState({}, \"About Page\", \"/about\");\nJavaScript is also capable of replacing any content in the …\nThe post Native JavaScript Routing? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/native-javascript-routing/",
          "publishedOn": "2021-08-23T14:28:14.000Z",
          "wordCount": 832,
          "title": "Native JavaScript Routing?"
        },
        {
          "id": "https://css-tricks.com/?p=350186",
          "author": "Chris Coyier",
          "description": "I appreciated this bit of nuance from a post on Viget’s blog:\nThere could be a whole article written about the many flavours of Tailwind, but broadly speaking those flavours are:\n1. Stock tailwind, ie. no changes to the \n…\nThe post “Disambiguating Tailwind” appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/disambiguating-tailwind/",
          "publishedOn": "2021-08-20T19:59:47.000Z",
          "wordCount": 585,
          "title": "“Disambiguating Tailwind”"
        },
        {
          "id": "https://css-tricks.com/?p=346702",
          "author": "Ganesh Dahal",
          "description": "Frontity is a WordPress-focused React-based server-side dynamic-rendering framework (phew!) that allows us to create fast headless websites. Chris has a good introduction to Frontity. I guess you could think of it like Next.js for WordPress. And while the demand …\nThe post Creating a Headless WordPress Site With Frontity appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/creating-headless-wordpress-site-with-frontity/",
          "publishedOn": "2021-08-20T14:59:30.000Z",
          "wordCount": 2966,
          "title": "Creating a Headless WordPress Site With Frontity"
        },
        {
          "id": "https://css-tricks.com/?p=350054",
          "author": "Chris Coyier",
          "description": "I’ve seen this confuse more than a handful of people recently, including myself, so I’m making sure it’s written down.\nLet’s chuck a couple of custom properties into CSS:\nhtml {\n  --color-1: red;\n  --color-2: blue;\n}\nLet’s use them right …\nThe post The Big Gotcha With Custom Properties appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/the-big-gotcha-with-custom-properties/",
          "publishedOn": "2021-08-19T19:04:48.000Z",
          "wordCount": 1217,
          "title": "The Big Gotcha With Custom Properties"
        },
        {
          "id": "https://css-tricks.com/?p=346563",
          "author": "Nader Dabit",
          "description": "Nuxt is a JavaScript framework that extends the existing functionality of Vue.js with features like server-side rendering, static page generation, file-based routing, and automatic code splitting among other things.\nI’ve been enjoying using frameworks like Nuxt and Next because they …\nThe post Using Nuxt and Supabase for  a Multi-User Blogging App appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-nuxt-and-supabase-for-a-multi-user-blogging-app/",
          "publishedOn": "2021-08-19T14:32:57.000Z",
          "wordCount": 4189,
          "title": "Using Nuxt and Supabase for  a Multi-User Blogging App"
        },
        {
          "id": "https://css-tricks.com/?p=350035",
          "author": "Shadid Haque",
          "description": "(This is a sponsored post.)\nIn this article, we will discuss how we can apply schema stitching across multiple Fauna instances. We will also discuss how to combine other GraphQL services and data sources with Fauna in one graph.…\nThe post Implementing a single GraphQL across multiple data sources appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/implementing-a-single-graphql-across-multiple-data-sources/",
          "publishedOn": "2021-08-19T14:30:41.000Z",
          "wordCount": 2398,
          "title": "Implementing a single GraphQL across multiple data sources"
        },
        {
          "id": "https://css-tricks.com/?p=348288",
          "author": "Chris Coyier",
          "description": "Over at the JS Party poundcast:\n[Kend C. Dodds]: […] ask anybody who’s done regular, old CSS and they’ll tell you that “I don’t know if it’s okay for me to change this, so I’m gonna duplicate it.” And \n…\nThe post “We had 90% unused CSS because everybody was afraid to touch the old stuff” appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/we-had-90-unused-css-because-everybody-was-afraid-to-touch-the-old-stuff/",
          "publishedOn": "2021-08-18T22:16:42.000Z",
          "wordCount": 725,
          "title": "“We had 90% unused CSS because everybody was afraid to touch the old stuff”"
        },
        {
          "id": "https://css-tricks.com/?p=346147",
          "author": "Paulina Hetman",
          "description": "Have you already tried using WordPress headlessly with Gatsby? If you haven’t, you might check this article around the new Gatsby source plugin for WordPress; gatsby-source-wordpress is the official source plugin introduced in March 2021 as a part of the …\nThe post Native Search vs. Jetpack Instant Search in Headless WordPress With Gatsby appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/native-search-vs-jetpack-instant-search-in-headless-wordpress-with-gatsby/",
          "publishedOn": "2021-08-18T14:46:09.000Z",
          "wordCount": 3678,
          "title": "Native Search vs. Jetpack Instant Search in Headless WordPress With Gatsby"
        },
        {
          "id": "https://css-tricks.com/?p=346697",
          "author": "Chris Coyier",
          "description": "Dave points to Sarah’s post on Developer Experience (DX) at Netlify. Part of what Sarah did there is lay out what the role means. It’s a three-part thing:\nIntegrations Engineering (e.g. features)\nDeveloper Experience Engineering (e.g. building integrations \n…\nThe post DX, to Whom? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/dx-to-whom/",
          "publishedOn": "2021-08-17T21:09:32.000Z",
          "wordCount": 542,
          "title": "DX, to Whom?"
        },
        {
          "id": "https://css-tricks.com/?p=346449",
          "author": "Leonardo Losoviz",
          "description": "I’ve been working on the same project for several years. Its initial version was a huge monolithic app containing thousands of files. It was poorly architected and non-reusable, but was hosted in a single repo making it easy to work …\nThe post From a Single Repo, to Multi-Repos, to Monorepo, to Multi-Monorepo appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/from-a-single-repo-to-multi-repos-to-monorepo-to-multi-monorepo/",
          "publishedOn": "2021-08-17T14:53:41.000Z",
          "wordCount": 3874,
          "title": "From a Single Repo, to Multi-Repos, to Monorepo, to Multi-Monorepo"
        },
        {
          "id": "https://css-tricks.com/?p=346418",
          "author": "Chris Coyier",
          "description": "Brian Kardell shares a bit about the progress of bringing \"Tabs\" to HTML. We kinda think we know what they are, but you have to be really specific when dealing with specs and defining them. It's tricky.\nThe post Tabs in HTML? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://bkardell.com/blog/SpicySections.html",
          "publishedOn": "2021-08-16T23:31:01.000Z",
          "wordCount": 1914,
          "title": "Tabs in HTML?"
        },
        {
          "id": "https://css-tricks.com/?p=346686",
          "author": "Chris Coyier",
          "description": "Ahmad Shadeed dug into shape “cutouts” the other day. Imagine a shape with another smaller shape carved out of it. In his typical comprehensive way, Ahmad laid out the situation well—looking at tricky situations that complicate things. \nThe first thing …\nThe post Cutouts appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://ishadeed.com/article/thinking-about-the-cut-out-effect/",
          "publishedOn": "2021-08-16T20:49:09.000Z",
          "wordCount": 2944,
          "title": "Cutouts"
        },
        {
          "id": "https://css-tricks.com/?p=346318",
          "author": "Alvaro Montoro",
          "description": "HTML is not a programming language.\nI’ve heard that sentence so many times and it’s tiring. Normally, it is followed by something like, It doesn’t have logic, or, It is not Turing complete,.so… obviously it is not a programming …\nThe post HTML is Not a Programming Language? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/html-is-not-a-programming-language/",
          "publishedOn": "2021-08-16T14:44:35.000Z",
          "wordCount": 3453,
          "title": "HTML is Not a Programming Language?"
        },
        {
          "id": "https://css-tricks.com/?p=346665",
          "author": "Chris Coyier",
          "description": "Looks like… 253 of them. I love the little water ⥾ spout one. (U+297e). Because. And I like how it’s a fairly useful little site at a great domain and with a little business model behind it. \nReminds …\nThe post Unicode Arrows appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://unicodearrows.com/",
          "publishedOn": "2021-08-13T18:08:07.000Z",
          "wordCount": 10,
          "title": "Unicode Arrows"
        },
        {
          "id": "https://css-tricks.com/?p=345944",
          "author": "John Polacek",
          "description": "Whether you are just starting out on the front end, or you’ve been doing it for a long time, building a tool that can generate some cool front-end magic can help you learn something new, develop your skills and maybe …\nThe post Building a Cool Front End Thing Generator appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/building-a-cool-front-end-thing-generator/",
          "publishedOn": "2021-08-13T14:41:21.000Z",
          "wordCount": 2034,
          "title": "Building a Cool Front End Thing Generator"
        },
        {
          "id": "https://css-tricks.com/?p=346608",
          "author": "Robin Rendle",
          "description": "A few days ago, Chris wrote up his thoughts about how alert(), confirm(), and prompt() were being deprecated by Chrome and collected a bunch of thoughts from developers. If certain features can essentially be turned off by …\nThe post Stay alert appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://dev.to/richharris/stay-alert-d",
          "publishedOn": "2021-08-12T21:10:22.000Z",
          "wordCount": 7934,
          "title": "Stay alert"
        },
        {
          "id": "https://css-tricks.com/?p=345687",
          "author": "John Rhea",
          "description": "Now that we’ve seen that web components and interactive web components are both easier than you think, let’s take a look at adding them to a content management system, namely WordPress.\nThere are three major ways we can add them. …\nThe post Using Web Components in WordPress is Easier Than You Think appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-web-components-in-wordpress-is-easier-than-you-think/",
          "publishedOn": "2021-08-12T14:38:36.000Z",
          "wordCount": 3452,
          "title": "Using Web Components in WordPress is Easier Than You Think"
        },
        {
          "id": "https://css-tricks.com/?p=346388",
          "author": "Chris Coyier",
          "description": "Heck of a CSS trick here from Dongsung Kim. \nThere are hidden HDR videos playing at the corners of this page. When a HDR-capable browser encounters one, it switches to HDR mode. For some reason, CSS backdrop-filter + brightness >100% \n…\nThe post Wanna see a whiter white? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://kidi.ng/wanna-see-a-whiter-white/",
          "publishedOn": "2021-08-11T19:09:36.000Z",
          "wordCount": 351,
          "title": "Wanna see a whiter white?"
        },
        {
          "id": "https://css-tricks.com/?p=345889",
          "author": "Mike Neumegen",
          "description": "You’ll often hear developers talking about “static” vs. “dynamic” sites, or you may have heard someone use the term Jamstack. What do these terms mean, and when does a “static” site become either a Jamstack or dynamic site? These …\nThe post Static vs. Dynamic vs. Jamstack: Where’s The Line? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/static-vs-dynamic-vs-jamstack-wheres-the-line/",
          "publishedOn": "2021-08-11T14:31:20.000Z",
          "wordCount": 3744,
          "title": "Static vs. Dynamic vs. Jamstack: Where’s The Line?"
        },
        {
          "id": "https://css-tricks.com/?p=346384",
          "author": "Chris Coyier",
          "description": "We took a surface level look at Pipedream the other day, which really does look cool. It’s like a much more modern and fancy version of what Yahoo Pipes was. A better comparison might be Zapier, except you …\nThe post Napkin appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.napkin.io/",
          "publishedOn": "2021-08-11T14:31:13.000Z",
          "wordCount": 104,
          "title": "Napkin"
        },
        {
          "id": "https://css-tricks.com/?p=346392",
          "author": "Chris Coyier",
          "description": "Have you ever wished you could see the HTML source of a web page while on a mobile browser, which generally doesn’t offer that feature? If you have a desktop machine around, there are ways, but what I mean …\nThe post View Source (on Mobile) appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://neatnik.net/view-source/",
          "publishedOn": "2021-08-10T21:26:34.000Z",
          "wordCount": 150,
          "title": "View Source (on Mobile)"
        },
        {
          "id": "https://css-tricks.com/?p=346392",
          "author": "Chris Coyier",
          "description": "Have you ever wished you could see the HTML source of a web page while on a mobile browser, which generally doesn’t offer that feature? If you have a desktop machine around, there are ways, but what I mean …\nThe post View Source (on Mobile) appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/view-source-on-mobile/",
          "publishedOn": "2021-08-10T21:26:34.000Z",
          "wordCount": 566,
          "title": "View Source (on Mobile)"
        },
        {
          "id": "https://css-tricks.com/?p=345861",
          "author": "Kitty Giraudel",
          "description": "Markdown truly is a great format. It’s close enough to plain text so that anyone can quickly learn it, and it’s structured enough that it can be parsed and eventually converted to you name it.\nThat being said: parsing, processing, …\nThe post Responsible Markdown in Next.js appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/responsible-markdown-in-next-js/",
          "publishedOn": "2021-08-10T14:55:07.000Z",
          "wordCount": 1590,
          "title": "Responsible Markdown in Next.js"
        },
        {
          "id": "https://css-tricks.com/?p=345799",
          "author": "Chris Coyier",
          "description": "(This is a sponsored post.)\nGot a WooCommerce store? It behooves you to offer a variety of payment methods. Just anecdotally, I’m sure both you and me have been annoyed and even abandoned purchases when a merchant, online or …\nThe post WooCommerce With Apple Pay and Google Pay appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/woocommerce-with-apple-pay-and-google-pay/",
          "publishedOn": "2021-08-10T14:54:56.000Z",
          "wordCount": 1293,
          "title": "WooCommerce With Apple Pay and Google Pay"
        },
        {
          "id": "https://css-tricks.com/?p=346355",
          "author": "Robin Rendle",
          "description": "Here’s Kilian Valkhof on CSS nesting which isn’t available in browsers yet, but will be soon. There are a few differences he notes between CSS nesting and nesting in Sass or Less though. Take, for example, the following code:\ndiv \n…\nThe post CSS Nesting, specificity, and you appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://kilianvalkhof.com/2021/css-html/css-nesting-specificity-and-you/",
          "publishedOn": "2021-08-10T14:51:39.000Z",
          "wordCount": 2378,
          "title": "CSS Nesting, specificity, and you"
        },
        {
          "id": "https://css-tricks.com/?p=346368",
          "author": "Chris Coyier",
          "description": "It might be the very first thing a lot of people learn in JavaScript:\nalert(\"Hello, World\");\nOne day at CodePen, we woke up to a ton of customer support tickets about their Pens being broken, which ultimately boiled down to …\nThe post Choice Words about the Upcoming Deprecation of JavaScript Dialogs appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/choice-words-about-the-upcoming-deprecation-of-javascript-dialogs/",
          "publishedOn": "2021-08-09T21:23:44.000Z",
          "wordCount": 1484,
          "title": "Choice Words about the Upcoming Deprecation of JavaScript Dialogs"
        },
        {
          "id": "https://css-tricks.com/?p=346316",
          "author": "Chris Coyier",
          "description": "We’ve got viewport units (e.g. vw, vh, vmin, vmax), and they are mostly pretty great. It’s cool to always have a unit available that is relative to the entire screen. But when you ask people what …\nThe post The Large, Small, and Dynamic Viewports appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.bram.us/2021/07/08/the-large-small-and-dynamic-viewports/",
          "publishedOn": "2021-08-09T20:37:39.000Z",
          "wordCount": 1999,
          "title": "The Large, Small, and Dynamic Viewports"
        },
        {
          "id": "https://css-tricks.com/?p=345642",
          "author": "Temani Afif",
          "description": "In my previous article, I created a fragmentation effect using CSS mask and custom properties. It was a neat effect but it has one drawback: it uses a lot of CSS code (generated using Sass). This time I am …\nThe post Exploring the CSS Paint API: Image Fragmentation Effect appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/exploring-the-css-paint-api-image-fragmentation-effect/",
          "publishedOn": "2021-08-09T14:27:18.000Z",
          "wordCount": 2534,
          "title": "Exploring the CSS Paint API: Image Fragmentation Effect"
        }
      ]
    },
    {
      "title": "Articles on Smashing Magazine — For Web Designers And Developers",
      "feedUrl": "https://www.smashingmagazine.com/feed/",
      "siteUrl": "https://www.smashingmagazine.com/",
      "articles": [
        {
          "id": "https://smashingmagazine.com/2021/09/http3-practical-deployment-options-part3/",
          "author": "hello@smashingmagazine.com (Robin Marx)",
          "description": "After almost five years in development, the new HTTP/3 protocol is nearing its final form. Let’s take a close look at the challenges involved in deploying and testing HTTP/3, and how and if you should change your websites and resources as well.",
          "link": "https://smashingmagazine.com/2021/09/http3-practical-deployment-options-part3/",
          "publishedOn": "2021-09-06T11:00:00.000Z",
          "wordCount": 9726,
          "title": "HTTP/3: Practical Deployment Options (Part 3)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a19cca97-b411-44a6-a8be-e1468a0df78a/http3-practical-deployment-options-part3.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/09/reducing-carbon-emissions-on-web/",
          "author": "hello@smashingmagazine.com (Berwyn Powell)",
          "description": "Websites, unfortunately, aren’t as environmentally friendly as we might like them to be. This article contains some thoughts and experiences from trying to clean them up.",
          "link": "https://smashingmagazine.com/2021/09/reducing-carbon-emissions-on-web/",
          "publishedOn": "2021-09-03T11:30:00.000Z",
          "wordCount": 3582,
          "title": "Reducing Carbon Emissions On The Web",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bdef7e38-4e37-4177-a7b3-d74860c7724f/reducing-carbon-emissions-on-web.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/09/interactive-learning-tools-front-end-developers/",
          "author": "hello@smashingmagazine.com (Louis Lazaris)",
          "description": "Interactive coding tools to help you learn CSS, JavaScript, SQL, React, Vim, regular expressions and Jamstack.",
          "link": "https://smashingmagazine.com/2021/09/interactive-learning-tools-front-end-developers/",
          "publishedOn": "2021-09-02T12:00:00.000Z",
          "wordCount": 2434,
          "title": "Interactive Learning Tools For Front-End Developers",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7f13aec3-8dd5-4085-afce-c752db3abfb6/interactive-learning-tools-front-end-developers.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/09/deep-dive-wonderful-world-svg-displacement-filtering/",
          "author": "hello@smashingmagazine.com (Dirk Weber)",
          "description": "What exactly is a displacement filter? In this article, Dirk Weber explains the SVG `feDisplacementMap` filter primitive with a good number of examples to demonstrate the concept of animated displacement maps.",
          "link": "https://smashingmagazine.com/2021/09/deep-dive-wonderful-world-svg-displacement-filtering/",
          "publishedOn": "2021-09-01T10:30:00.000Z",
          "wordCount": 5583,
          "title": "A Deep Dive Into The Wonderful World Of SVG Displacement Filtering",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/92af7db6-94b4-4e48-8e20-875af2d5e024/deep-dive-svg-displacement-filtering.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/state-management-nextjs/",
          "author": "hello@smashingmagazine.com (Átila Fassina)",
          "description": "By combining some React APIs, we can accurately manage “simple” states. With Next.js though, we can quickly find situations where we need to accommodate many other requirements. Let’s have a look at some patterns to accomplish all that.",
          "link": "https://smashingmagazine.com/2021/08/state-management-nextjs/",
          "publishedOn": "2021-08-31T14:00:00.000Z",
          "wordCount": 2894,
          "title": "State Management In Next.js",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7be7a6e9-5d44-4941-8a6c-dfee3435cc9b/state-management-nextjs.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/desktop-wallpaper-calendars-september-2021/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "New month, new wallpapers! In this post, you’ll find inspiring wallpaper designs for September 2021. They were created with love by artists and designers from across the globe and are available with and without a calendar. Enjoy!",
          "link": "https://smashingmagazine.com/2021/08/desktop-wallpaper-calendars-september-2021/",
          "publishedOn": "2021-08-31T08:00:00.000Z",
          "wordCount": 2409,
          "title": "Stories Of September (2021 Desktop Wallpapers Edition)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bdfaaaac-a4fb-475b-997c-ac45db998da0/sep-21-finding-the-balance-preview-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/refactoring-css-optimizing-size-performance-part3/",
          "author": "hello@smashingmagazine.com (Adrian Bece)",
          "description": "There are many CSS optimization techniques to tackle potential file size and performance issues. Let’s take a look at some of them. After all, if deploying the refactored codebase causes loading or performance issues, it will result in less traffic and revenue, which might leave the management and project managers dissatisfied.",
          "link": "https://smashingmagazine.com/2021/08/refactoring-css-optimizing-size-performance-part3/",
          "publishedOn": "2021-08-30T10:00:00.000Z",
          "wordCount": 3696,
          "title": "Refactoring CSS: Optimizing Size And Performance (Part 3)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fa4e0eab-b23c-42ac-a622-b2ca8a02edd0/refactoring-css-optimizing-size-performance-part3.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/compound-components-react/",
          "author": "hello@smashingmagazine.com (Ichoku Chinonso)",
          "description": "Compound components help developers build more expressive and flexible APIs to share state and logic within components. This tutorial explains how this can be achieved with the help of using the Context API and React to build components by using this advanced pattern.",
          "link": "https://smashingmagazine.com/2021/08/compound-components-react/",
          "publishedOn": "2021-08-27T13:00:00.000Z",
          "wordCount": 3120,
          "title": "Compound Components In React",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e9df8cb4-b274-407a-97a8-f06488571802/compound-components-react.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/against-privacy-infringement-web/",
          "author": "hello@smashingmagazine.com (Robin Berjon)",
          "description": "The Web is still wrestling with issues we take for granted offline, privacy chief among them. These are steps The New York Times took to protect users’ data, and how you can too.",
          "link": "https://smashingmagazine.com/2021/08/against-privacy-infringement-web/",
          "publishedOn": "2021-08-26T08:00:00.000Z",
          "wordCount": 3770,
          "title": "Pushing Back Against Privacy Infringement On The Web",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fbab17a6-483b-4e8e-b9f1-9ab583202df1/against-privacy-infringement-web.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/public-private-multi-monorepo-php-projects/",
          "author": "hello@smashingmagazine.com (Leonardo Losoviz)",
          "description": "In this article, Leonardo explains how to use a \"multi-monorepo\" approach for making the development experience faster, yet keeping your PHP packages private. This solution can be especially beneficial for PRO plugin creators.",
          "link": "https://smashingmagazine.com/2021/08/public-private-multi-monorepo-php-projects/",
          "publishedOn": "2021-08-25T07:10:00.000Z",
          "wordCount": 3495,
          "title": "Creating A Public/Private Multi-Monorepo For PHP Projects",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a223ab2b-d926-4fec-a422-bed6e7b02178/01-architecture.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/automate-documentation-workflow-for-developers/",
          "author": "hello@smashingmagazine.com (Portia Burton)",
          "description": "In this article, you’ll learn how to save hours of tedious work of writing, updating, and correcting technical documentation. In this article, you will learn how to automate your documentation workflow with Vale and GitHub Actions.",
          "link": "https://smashingmagazine.com/2021/08/automate-documentation-workflow-for-developers/",
          "publishedOn": "2021-08-24T13:00:00.000Z",
          "wordCount": 3231,
          "title": "How To Automate Documentation Workflow For Developers",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/68266575-8f47-415b-9c91-7004a02944ee/action-github-1.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/http3-performance-improvements-part2/",
          "author": "hello@smashingmagazine.com (Robin Marx)",
          "description": "After almost five years in development, the new HTTP/3 protocol is nearing its final form. Let’s take a close look at the performance improvements of HTTP/3, congestion control, head-of-line-blocking, and 0-RTT connection set-up.",
          "link": "https://smashingmagazine.com/2021/08/http3-performance-improvements-part2/",
          "publishedOn": "2021-08-23T06:20:00.000Z",
          "wordCount": 10546,
          "title": "HTTP/3: Performance Improvements (Part 2)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9d5e5ddd-7a90-48c6-84c5-dc5c335e2305/congestion-control.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/history-future-jamstack-cms/",
          "author": "hello@smashingmagazine.com (Mike Neumegen)",
          "description": "The story of Jamstack CMSs goes all the way back to the 90s. In this article, we take a trip down memory lane to see how we got to the modern Jamstack CMSs we have today, and where they’re heading in the next decade.",
          "link": "https://smashingmagazine.com/2021/08/history-future-jamstack-cms/",
          "publishedOn": "2021-08-20T08:00:00.000Z",
          "wordCount": 4602,
          "title": "Jamstack CMS: The Past, The Present and The Future",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f2f37c71-d2c5-4634-b62c-2dc2eea127c1/history-future-jamstack-cms.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/ethical-user-research-practice/",
          "author": "hello@smashingmagazine.com (Devin Harold)",
          "description": "Through a simple step-by-step approach, you can build an ethical practice within your organization that will ensure you’re respecting the dignity and welfare of your research participants.",
          "link": "https://smashingmagazine.com/2021/08/ethical-user-research-practice/",
          "publishedOn": "2021-08-19T10:00:00.000Z",
          "wordCount": 5340,
          "title": "How To Build An Ethical User Research Practice At Any Organization",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/72fbade7-8284-47ba-93d7-0f8a7aefdb7e/ethical-user-research-practice.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/interactive-gantt-chart-component-vanilla-javascript/",
          "author": "hello@smashingmagazine.com (Anna Prenzel)",
          "description": "In this article, we will code a Gantt chart as a reusable Web component. We will focus on the architecture of the component, rendering the calendar with CSS Grid and managing the state of the draggable tasks with JavaScript Proxy Objects.",
          "link": "https://smashingmagazine.com/2021/08/interactive-gantt-chart-component-vanilla-javascript/",
          "publishedOn": "2021-08-18T08:00:00.000Z",
          "wordCount": 3316,
          "title": "Creating An Interactive Gantt Chart Component With Vanilla JavaScript",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3bcf1248-c58e-47f4-a94f-3cbac5c60b45/interactive-gantt-chart-component-vanillajs.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/open-source-icons/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "Your project is on a tight budget? We’ve collected some wonderful, free icons and goodies that we’ve discovered lately and that are bound to give your design the finishing touch. We’ve also just recently covered [Figma plugins](https://www.smashingmagazine.com/2021/08/figma-tools-plugins-resources/), [SVG generators](https://www.smashingmagazine.com/2021/03/svg-generators/), [accessible front-end components](https://www.smashingmagazine.com/2021/03/complete-guide-accessible-front-end-components/) and [front-end boilerplates](https://www.smashingmagazine.com/2021/06/useful-frontend-boilerplates-starter-kits/) — you might find them useful, too.",
          "link": "https://smashingmagazine.com/2021/08/open-source-icons/",
          "publishedOn": "2021-08-17T07:25:00.000Z",
          "wordCount": 1864,
          "title": "Free Open-Source Icons",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/337b471a-0798-410d-9670-1d63c5bebfdc/05-tourism.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/develop-business-technology-roadmap/",
          "author": "hello@smashingmagazine.com (Cache Merril)",
          "description": "Software development without a roadmap is akin to driving off a cliff — an undertaking that seriously jeopardizes your product’s life. Here’s how to develop a business technology roadmap that ensures your project safely reaches its final destination.",
          "link": "https://smashingmagazine.com/2021/08/develop-business-technology-roadmap/",
          "publishedOn": "2021-08-16T06:55:00.000Z",
          "wordCount": 2949,
          "title": "How To Develop Your Business’ Technology Roadmap",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a6b3fa2a-b540-45e6-9423-f299fc4b6835/develop-business-technology-roadmap.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/Figma-tools-plugins-resources/",
          "author": "hello@smashingmagazine.com (Janet John)",
          "description": "Useful Figma plugins that will help you fix all the little slowdowns and boost your productivity. From color management and image assets to SVG shapes and animation. That’s our new guide to Figma.",
          "link": "https://smashingmagazine.com/2021/08/Figma-tools-plugins-resources/",
          "publishedOn": "2021-08-12T13:30:00.000Z",
          "wordCount": 6642,
          "title": "Useful Figma Plugins And Tools",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2a4221c8-35b1-4545-9561-12fe84087ae6/6681a4b9-c319-4421-8364-6d2654cf6e53-cover.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/new-smashing-online-workshops-aug-oct-2021/",
          "author": "hello@smashingmagazine.com (Iris Lješnjanin)",
          "description": "How do we build and establish a successful, bulletproof design system? What’s the state of HTML Email? And what are new, smart interface design patterns we could use? Let’s find out. With our [brand new online workshops](https://smashingconf.com/online-workshops/) on front-end & design — to help us all boost skills online.",
          "link": "https://smashingmagazine.com/2021/08/new-smashing-online-workshops-aug-oct-2021/",
          "publishedOn": "2021-08-11T13:25:00.000Z",
          "wordCount": 851,
          "title": "New Smashing Workshops on Front-End & Design",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1a95c729-8b29-4b44-90b0-d38183b367c0/online-workshops-2021-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/mounting-unmounting-navigation-routes-react-native/",
          "author": "hello@smashingmagazine.com (Daniel Don)",
          "description": "Often you need two different sets of navigation stacks for pre and post user authentication. Usually, to see more content, you have to be authenticated in some way. Let’s look at how to mount and unmount navigation stack based on a met condition in React Native.",
          "link": "https://smashingmagazine.com/2021/08/mounting-unmounting-navigation-routes-react-native/",
          "publishedOn": "2021-08-11T11:40:00.000Z",
          "wordCount": 5016,
          "title": "Handling Mounting And Unmounting Of Navigation Routes In React Native",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/03d97d60-d23b-419c-acb3-23e467d4cc16/mounting-unmounting-navigation-routes-react-native.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/cookieless-alternative-embed-html-css-js-code-examples/",
          "author": "hello@smashingmagazine.com (Henrik Fricke)",
          "description": "Embedding code examples with third-party scripts often leads to tracking or cookies. We always wanted to have a simple website with a good UX, so setting cookies for no reason wasn’t an option for us. Now, with Indiepen, we are proud to introduce a privacy-friendly alternative.",
          "link": "https://smashingmagazine.com/2021/08/cookieless-alternative-embed-html-css-js-code-examples/",
          "publishedOn": "2021-08-10T11:45:00.000Z",
          "wordCount": 847,
          "title": "Cookieless Alternative To Embed HTML, CSS And JS Code Snippets",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0fa2ab15-b98d-48b5-ab26-8a1fde75c13f/cookieless-alternative-embed-html-css-js-code-examples.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/smashing-podcast-episode-41/",
          "author": "hello@smashingmagazine.com (Drew McLellan)",
          "description": "In this episode, we’re talking about designing for safety. What does it mean to consider vulnerable users in our designs? Drew McLellan talks to expert Eva PenzeyMoog to find out.",
          "link": "https://smashingmagazine.com/2021/08/smashing-podcast-episode-41/",
          "publishedOn": "2021-08-10T05:00:00.000Z",
          "wordCount": 6902,
          "title": "Smashing Podcast Episode 41 With Eva PenzeyMoog: Designing For Safety",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7449af49-11de-4b63-b8fd-ff823d54b095/smashing-podcast-episode-41.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/08/http3-core-concepts-part1/",
          "author": "hello@smashingmagazine.com (Robin Marx)",
          "description": "What exactly is HTTP/3? Why was it needed so soon after HTTP/2 (which was only finalized in 2015)? How can or should you use it? And especially, how does this improve web performance? Let’s find out.",
          "link": "https://smashingmagazine.com/2021/08/http3-core-concepts-part1/",
          "publishedOn": "2021-08-09T11:00:00.000Z",
          "wordCount": 6868,
          "title": "HTTP/3 From A To Z: Core Concepts (Part 1)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8f9f9146-4b77-494d-af72-4db28567a6fe/http3-core-concepts-part1.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news",
      "articles": [
        {
          "id": "5f9c986d740569d1a4ca1a04",
          "author": null,
          "description": "Nine years ago, universities like MIT and Stanford first opened up free online courses to the public. Today, close to 1,000 schools around the world have created thousands of free online courses. I’ve compiled this list of 700 such free online courses that you can start this month.",
          "link": "https://www.freecodecamp.org/news/free-online-programming-cs-courses/",
          "publishedOn": "2021-09-06T07:04:00.000Z",
          "wordCount": 6433,
          "title": "700 Free Online Programming &amp; Computer Science Courses You Can Start This September"
        },
        {
          "id": "61320541d6679a07b7d416a2",
          "author": null,
          "description": "You use the HTML select tag to create drop-down menus so that users can select the value they want. It is an instrumental feature in collecting data to be sent to a server.  The select tag normally goes within a form element, with the items to choose from coded within",
          "link": "https://www.freecodecamp.org/news/html-select-tag-how-to-make-a-dropdown-menu-or-combo-list/",
          "publishedOn": "2021-09-03T15:03:03.000Z",
          "wordCount": 1416,
          "title": "HTML Select Tag – How to Make a Dropdown Menu or Combo List"
        },
        {
          "id": "6106588a3306a507d1bfc10c",
          "author": null,
          "description": "In Python, you can sort data by using the sorted() method or sort() method.  In this article, I will provide code examples for the sorted() and sort() methods and explain the differences between the two. What is the sort() method in Python?This method takes a list and sorts it",
          "link": "https://www.freecodecamp.org/news/python-sort-list-how-to-order-by-descending-or-ascending/",
          "publishedOn": "2021-09-03T14:49:55.000Z",
          "wordCount": 973,
          "title": "Python Sort List – How to Order By Descending or Ascending"
        },
        {
          "id": "612f86fcd6679a07b7d401b3",
          "author": null,
          "description": "In  this tutorial, we are going to build a simple landing page for an online education platform called Skilllz. This tutorial will teach you how to use and implement CSS Flexbox and CSS Grid alignment. We'll also cover many other CSS concepts as well. The tutorial is divided into three",
          "link": "https://www.freecodecamp.org/news/css-flexbox-and-grid-tutorial/",
          "publishedOn": "2021-09-02T17:16:52.000Z",
          "wordCount": 2815,
          "title": "CSS Flexbox and Grid Tutorial – How to Build a Landing Page with Just HTML and CSS"
        },
        {
          "id": "6130cfc9d6679a07b7d40bfb",
          "author": null,
          "description": "Windows Task Manager is an advanced utility tool that helps you manage your apps that are running.  Task Manager lets you see which apps are open and which you're using. You can also see which apps are running in the background that you didn't open yourself.  One important reason that",
          "link": "https://www.freecodecamp.org/news/how-to-open-task-manager-in-windows-10/",
          "publishedOn": "2021-09-02T16:17:55.000Z",
          "wordCount": 822,
          "title": "How to Open Task Manager in Windows 10"
        },
        {
          "id": "5fccd593e6787e098393ae5b",
          "author": null,
          "description": "A botnet is a collection of internet connected devices (anything from PCs to IoT devices) which are infected by the same malware.  A hacker uses the malware the botnet is infected with to control it and launch botnet attacks. The attacks are more effective when launched using hundreds, or thousands,",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-botnet/",
          "publishedOn": "2021-09-02T14:52:50.000Z",
          "wordCount": 1956,
          "title": "What is a Botnet – Botnet Definition and How to Defend Against Attacks"
        },
        {
          "id": "612a2408b5177808226d33cb",
          "author": null,
          "description": "When you want to design complex layouts, you'll need to change the typical  document flow and override the default browser styles.  You have to control how elements behave and are positioned on the page.  For example, you may want to stack elements next to each other or on top of",
          "link": "https://www.freecodecamp.org/news/css-positioning-position-absolute-and-relative/",
          "publishedOn": "2021-09-01T18:30:19.000Z",
          "wordCount": 1434,
          "title": "CSS Positioning – Position Absolute and Relative Example"
        },
        {
          "id": "612cc013b5177808226d4a5d",
          "author": null,
          "description": "If you want to delete a photo album on an iPhone, it only takes a few simple steps.  In this short article, I will walk you through the six steps to delete an album from your iPhone.  Step 1: Go to the Photos app on your phoneFirst, you need to",
          "link": "https://www.freecodecamp.org/news/how-to-delete-albums-on-iphone/",
          "publishedOn": "2021-09-01T17:53:57.000Z",
          "wordCount": 459,
          "title": "How to Delete Albums on iPhone"
        },
        {
          "id": "612fa76ed6679a07b7d40275",
          "author": null,
          "description": "Setting text color on a website you're building might be confusing at first. But in this article, you'll learn how to do it.  How to Set Text Color in HTML In CSS, the background-color property is pretty straightforward for setting the background color of anything.  So what if you want",
          "link": "https://www.freecodecamp.org/news/css-font-color-how-to-style-text-in-html/",
          "publishedOn": "2021-09-01T17:27:17.000Z",
          "wordCount": 1113,
          "title": "CSS Font Color – How to Style Text in HTML"
        },
        {
          "id": "612a4e71b5177808226d3767",
          "author": null,
          "description": "When you're working with an array collection, sometimes you'll only need to find out if an item exists in the array so you can retrieve it. And you won't care how many other items (if any) exist within the same array.  Well, we can use the find() method to do",
          "link": "https://www.freecodecamp.org/news/javascript-array-find-tutorial-how-to-iterate-through-elements-in-an-array/",
          "publishedOn": "2021-09-01T16:41:26.000Z",
          "wordCount": 1372,
          "title": "JavaScript Array.find() Tutorial – How to Iterate Through Elements in an Array"
        },
        {
          "id": "612e1ae2d6679a07b7d3f4c4",
          "author": null,
          "description": "Machines or computers only understand numbers. And these numbers need to be represented and processed in a way that lets machines solve problems by learning from the data instead of learning from predefined instructions (as in the case of programming). All types of programming use mathematics at some level. Machine",
          "link": "https://www.freecodecamp.org/news/how-machine-learning-leverages-linear-algebra-to-optimize-model-trainingwhy-you-should-learn-the-fundamentals-of-linear-algebra/",
          "publishedOn": "2021-09-01T15:47:54.000Z",
          "wordCount": 1451,
          "title": "How Machine Learning Uses Linear Algebra to Solve Data Problems"
        },
        {
          "id": "612b4321b5177808226d3b8b",
          "author": null,
          "description": "When working with strings in Python, you may need to search through strings for a pattern, or even replace parts of strings with another substring.  Python has the useful string methods find() and replace() that help us perform these string processing tasks.  In this tutorial, we'll learn about these two",
          "link": "https://www.freecodecamp.org/news/python-string-methods-tutorial-how-to-use-find-and-replace-on-python-strings/",
          "publishedOn": "2021-09-01T15:39:30.000Z",
          "wordCount": 1400,
          "title": "Python String Methods Tutorial – How to Use find() and replace() on Python Strings"
        },
        {
          "id": "612909cdb5177808226d2f1d",
          "author": null,
          "description": "Figma is a vector graphics editor and prototyping tool that is great for designing websites. We just released a Figma course on the freeCodeCmap.org YouTube channel that will teach you how to use the tool to design websites. Joy Shaheb developed the course. Joy is a prolific tutorial creator",
          "link": "https://www.freecodecamp.org/news/how-to-use-figma-to-design-websites/",
          "publishedOn": "2021-09-01T13:21:54.000Z",
          "wordCount": 37407,
          "title": "How to Use Figma to Design Websites"
        },
        {
          "id": "612cc025b5177808226d4a67",
          "author": null,
          "description": "If you use Instagram, you may have needed to block certain accounts from time to time. But what if things change and you want to unblock someone?  In this article, I will walk you through the three ways to unblock someone on Instagram using the mobile app for iPhone and",
          "link": "https://www.freecodecamp.org/news/how-to-unblock-someone-on-instagram/",
          "publishedOn": "2021-08-31T21:30:46.000Z",
          "wordCount": 478,
          "title": "How to Unblock Someone on Instagram"
        },
        {
          "id": "612ddfa9d6679a07b7d3f3c9",
          "author": null,
          "description": "Loops are a useful and frequently used feature in all modern programming languages.  If you want to automate a specific repetitive task or prevent yourself from writing repetitive code in your programs, using a loop is the best option for that.  Loops are a set of instructions that run repeatedly",
          "link": "https://www.freecodecamp.org/news/python-do-while-loop-example/",
          "publishedOn": "2021-08-31T21:15:26.000Z",
          "wordCount": 1349,
          "title": "Python Do While – Loop Example"
        },
        {
          "id": "61134bed72231b077cdad5e1",
          "author": null,
          "description": "The only perfect code is code that has never been written. As a developer, you are bound to face errors and will be responsible for debugging them.  If you're coding in Python, you can always look at its error messages to figure out what's going on. But what if an",
          "link": "https://www.freecodecamp.org/news/logging-in-python-debug-your-django-projects/",
          "publishedOn": "2021-08-31T20:46:24.000Z",
          "wordCount": 1517,
          "title": "Logging in Python – How to Use Logs to Debug Your Django Projects"
        },
        {
          "id": "612e6908d6679a07b7d3fad2",
          "author": null,
          "description": "When you're building a website, you may want to place particular emphasis on certain text to let users know that it's important.  And you can do this in HTML with various text formatting tags.  In this article, I will take you through how to emphasize certain text by making it",
          "link": "https://www.freecodecamp.org/news/bold-font-in-html-font-weight-for-letters/",
          "publishedOn": "2021-08-31T20:35:21.000Z",
          "wordCount": 787,
          "title": "Bold Font in HTML – Font Weight for Letters"
        },
        {
          "id": "611d6719e884de07521811de",
          "author": null,
          "description": "Say you're working on your code in Git and something didn't go as planned. So now you need to revert your last commit. How do you do it? Let's find out! There are two possible ways to undo your last commit. We'll look at both of them in this article.",
          "link": "https://www.freecodecamp.org/news/git-revert-commit-how-to-undo-the-last-commit/",
          "publishedOn": "2021-08-31T20:20:41.000Z",
          "wordCount": 573,
          "title": "Git Revert Commit – How to Undo the Last Commit"
        },
        {
          "id": "611e90d03bccf807612a352a",
          "author": null,
          "description": "Releasing modern software might seem daunting and complicated. In this article, I'll expand on the concepts involved in the process, from managing dependencies to building in the cloud. Articles and tutorials usually cover a specific tool and dive right into it before laying down the foundational knowledge. In this article,",
          "link": "https://www.freecodecamp.org/news/release-management-modern-software-development/",
          "publishedOn": "2021-08-31T17:00:00.000Z",
          "wordCount": 2334,
          "title": "Release Management for Modern Software Development – How to Manage Dependencies, SemVer, and Build Systems for Beginners"
        },
        {
          "id": "60ffa3a33306a507d1bf97e9",
          "author": null,
          "description": "People have long debated which is the best operating system for developers.  In order for us to answer this question, we first need to understand a few things, like:  What is an operating system? The history of operating systems How an operating system works Types and examples of operating systems",
          "link": "https://www.freecodecamp.org/news/what-is-an-os-operating-system-definition-for-beginners/",
          "publishedOn": "2021-08-31T16:50:03.000Z",
          "wordCount": 2268,
          "title": "What is an OS? Operating System Definition for Beginners"
        },
        {
          "id": "6127fc01b5177808226d2b46",
          "author": null,
          "description": "Selenium is a powerful web automation tool that can be used for browser automation, to test front-end code, and create web scraping bots. We just released a full course on the freeCodeCamp.org website that will teach you Selenium while you build a web scraping bot. Jim from JimShapedCoding developed",
          "link": "https://www.freecodecamp.org/news/use-selenium-to-create-a-web-scraping-bot/",
          "publishedOn": "2021-08-31T12:43:06.000Z",
          "wordCount": 29022,
          "title": "Use Selenium to Create a Web Scraping Bot"
        },
        {
          "id": "610648fd3306a507d1bfbfed",
          "author": null,
          "description": "If you are new to the tech industry, you might have heard of the term Full Stack. But what does that mean exactly? In this article, I will explain what Full Stack Development is, what skills you need to become a Full Stack Developer, salary expectations, and tips for landing",
          "link": "https://www.freecodecamp.org/news/what-is-a-full-stack-developer-back-end-front-end-full-stack-engineer/",
          "publishedOn": "2021-08-30T21:56:06.000Z",
          "wordCount": 1770,
          "title": "What is a Full Stack Developer? Back End + Front End &#x3D; Full Stack Engineer"
        },
        {
          "id": "611d6736e884de07521811e6",
          "author": null,
          "description": "Linux is a popular open source operating system, and its features are often available in your development environment. If you can learn its basic commands, it'll make your life as a developer much easier. In this guide you will learn how to delete directories and files from the Linux command",
          "link": "https://www.freecodecamp.org/news/remove-a-directory-in-linux-how-to-delete-directories-and-contents-from-the-command-line/",
          "publishedOn": "2021-08-30T21:35:33.000Z",
          "wordCount": 745,
          "title": "Remove a Directory in Linux – How to Delete Directories and Contents From the Command Line"
        },
        {
          "id": "612a9e08b5177808226d384b",
          "author": null,
          "description": "Async and await might sound complicated...but they're as easy as pizza pie once you dive in.  We all use async and await in our daily routines.  What is an async task? An async task lets you complete other tasks while the async task is still working towards completion.  Here",
          "link": "https://www.freecodecamp.org/news/async-await-javascript-tutorial-explained-by-making-pizza/",
          "publishedOn": "2021-08-30T20:20:59.000Z",
          "wordCount": 980,
          "title": "Async and Await in JavaScript Explained by Making Pizza"
        },
        {
          "id": "61274ec43bccf807612a85b9",
          "author": null,
          "description": "In this tutorial, we are going to be building a simple movie generator which automatically generates a new movie every 40 seconds. It will also contain a button called “Generate New Movie” to display another movie on demand. This app will display a movie along with its title, release date,",
          "link": "https://www.freecodecamp.org/news/react-tutorial-build-a-movie-list-generator-with-react-and-harperdb/",
          "publishedOn": "2021-08-30T19:07:30.000Z",
          "wordCount": 4102,
          "title": "React Tutorial – Build a Movie List Generator with React and HarperDB"
        },
        {
          "id": "612686bf3bccf807612a7fdc",
          "author": null,
          "description": "I just joined Cisco Systems, India as a Senior Software Engineer (SDE III) on July 28, 2021. I am working with the Cisco Customer Experience team as a UI developer. The entire journey from applying for the job to accepting the offer was two months long. I wish to share",
          "link": "https://www.freecodecamp.org/news/senior-software-engineer-interview-questions-how-i-got-a-job-as-an-sde-3-and-how-you-can-prepare-for-the-rounds/",
          "publishedOn": "2021-08-30T17:56:48.000Z",
          "wordCount": 2817,
          "title": "Senior Software Engineer Interview Questions – Tips to Help You Prepare for a Job Interview"
        },
        {
          "id": "6124028b3bccf807612a69ee",
          "author": null,
          "description": "Gitpod and GitHub Codespaces are cloud based developer environments that allow you to spin-up high-performance, automated dev environments in seconds. Over the past few months I have gone down the rabbit hole of cloud-based developer environments. I'm moving several of my projects to the cloud so that developers can deploy",
          "link": "https://www.freecodecamp.org/news/github-codespaces-vs-gitpod-cloud-based-dev-environments/",
          "publishedOn": "2021-08-30T17:10:36.000Z",
          "wordCount": 2802,
          "title": "GitHub Codespaces vs Gitpod – Full Stack Development Moves to the Cloud"
        },
        {
          "id": "6125e9f83bccf807612a7a65",
          "author": null,
          "description": "Contact forms are useful on websites if you want your users to be able to interact with you over email. And there are lots of ways to build them. Traditionally you'd have either used PHP for sending emails over the server or some third party service that would take care",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-working-contact-form-with-sendgrid-and-next-js/",
          "publishedOn": "2021-08-30T15:24:14.000Z",
          "wordCount": 3593,
          "title": "How to Build a Contact Form with SendGrid and Next.js"
        },
        {
          "id": "6128e12fb5177808226d2e4f",
          "author": null,
          "description": "PHP is an open-source server-side scripting language that many devs use for web development. It is also a general-purpose language that you can use to make lots of projects, including Graphical User Interfaces (GUIs).  In this article, I will help you explore the world of PHP so you can learn",
          "link": "https://www.freecodecamp.org/news/what-is-php-the-php-programming-language-meaning-explained/",
          "publishedOn": "2021-08-30T15:13:30.000Z",
          "wordCount": 1285,
          "title": "What is PHP? The PHP Programming Language Meaning Explained"
        },
        {
          "id": "6120ec0b3bccf807612a4bf3",
          "author": null,
          "description": "NodeJS is an asynchronous event-driven JavaScript runtime environment designed to build scalable network applications.  Asynchronous here refers to all those functions in JavaScript that are processed in the background without blocking any other request.  In this article, you will learn and understand how NodeJS works and handles all functions or",
          "link": "https://www.freecodecamp.org/news/nodejs-eventloop-tutorial/",
          "publishedOn": "2021-08-30T15:11:16.000Z",
          "wordCount": 1414,
          "title": "Event Loops in NodeJS – Beginner&#x27;s Guide to Synchronous and Asynchronous Code"
        },
        {
          "id": "6127b75d3bccf807612a8c40",
          "author": null,
          "description": "Every day more and more use cases are found for machine learning. It is a great field to get into. We just released a 10-hour machine learning course for beginners on the freeCodeCamp.org YouTube channel. Ayush Singh developed this course. He is a young data scientist and machine learning",
          "link": "https://www.freecodecamp.org/news/free-machine-learning-course-10-hourse/",
          "publishedOn": "2021-08-30T13:36:04.000Z",
          "wordCount": 516,
          "title": "Free 10-Hour Machine Learning Course"
        },
        {
          "id": "600dc4230a2838549dcb6e8e",
          "author": null,
          "description": "Arrays are a powerful data type in PHP. And knowing how to quickly determine the size of an array is a useful skill.  In this article I'll give you a quick overview of how arrays work, and then I'll dive into how to get the size of PHP arrays. If",
          "link": "https://www.freecodecamp.org/news/php-array-length-how-to-get-an-array-size/",
          "publishedOn": "2021-08-27T19:10:13.000Z",
          "wordCount": 1138,
          "title": "PHP Array Length Tutorial – How to Get an Array Size"
        },
        {
          "id": "612796f53bccf807612a8b55",
          "author": null,
          "description": "I first had what I can only describe as a spiritual awakening about 10 years ago to the fact that technology would (figuratively) rule the world. And since then, I've been obsessed with wanting to understand how software works and how to build it. Since that moment, my life has",
          "link": "https://www.freecodecamp.org/news/the-new-creator-economy-daos-community-ownership-and-cryptoeconomics/",
          "publishedOn": "2021-08-27T17:02:29.000Z",
          "wordCount": 2650,
          "title": "The New Creator Economy – DAOs, Community Ownership, and Cryptoeconomics"
        },
        {
          "id": "6127e0efb5177808226d29cb",
          "author": null,
          "description": "When the internet was still young, website visitors used desktop and then laptop computers with wide screens to access websites.  Then when smart phones were developed, mobile phone users had to endlessly zoom and scroll to access and view different parts of those same websites.  Thankfully, this is no longer",
          "link": "https://www.freecodecamp.org/news/responsive-web-design-modern-website-code-for-beginners/",
          "publishedOn": "2021-08-27T16:33:18.000Z",
          "wordCount": 2359,
          "title": "Responsive Web Design – Modern Website Code for Beginners"
        },
        {
          "id": "612203fb3bccf807612a5756",
          "author": null,
          "description": "Have you ever wondered if there is a method to delay your JavaScript code by a few seconds?  In this article, I will explain what the setTimeout() method is with code examples and how it differs from setInterval().  What is setTimeout() in JavaScript?setTimeout() is a method that will execute",
          "link": "https://www.freecodecamp.org/news/javascript-settimeout-js-timer-to-delay-n-seconds/",
          "publishedOn": "2021-08-26T23:57:34.000Z",
          "wordCount": 1114,
          "title": "JavaScript setTimeout() – JS Timer to Delay N Seconds"
        },
        {
          "id": "6117b37a72231b077cdafea8",
          "author": null,
          "description": "Choosing the right font is an important first step in making your website usable and accessible.  How text is formatted affects how readable your designs and webpages are.  You can modify how your HTML text appears in many ways using CSS. You can select the type of font you want",
          "link": "https://www.freecodecamp.org/news/html-font-css-font-family-example-serif-and-sans-serif-characters/",
          "publishedOn": "2021-08-26T22:15:30.000Z",
          "wordCount": 1459,
          "title": "HTML Font – CSS Font Family Example (Serif and Sans Serif Characters)"
        },
        {
          "id": "6107c0083306a507d1bfc549",
          "author": null,
          "description": "In a Relational Database, tables are often related to each other in a way that allows their information to only be written once in the whole database. Then, when you need to analyze the data, you'll need to combine the info from those related tables. To do this in SQL,",
          "link": "https://www.freecodecamp.org/news/sql-left-join-example-join-statement-syntax/",
          "publishedOn": "2021-08-26T20:29:12.000Z",
          "wordCount": 1425,
          "title": "SQL Left Join – Example Join Statement Syntax"
        },
        {
          "id": "60b5025111ffb70827ef9ebe",
          "author": null,
          "description": "Would you like to talk to a chatbot that speaks like your favorite character, fictional or non-fictional? Let's build one!  In case you've seen my previous tutorial on this topic, stick with me as this version features lots of updates. You can follow along with this tutorial using the code",
          "link": "https://www.freecodecamp.org/news/discord-ai-chatbot/",
          "publishedOn": "2021-08-26T19:30:00.000Z",
          "wordCount": 1750,
          "title": "How to Build a Discord AI Chatbot that Talks Like Your Favorite Character"
        },
        {
          "id": "6125f93b3bccf807612a7b84",
          "author": null,
          "description": "Git is a popular version control system and an essential tool in a web developer's toolkit.  Branches are a powerful and integral part of working with Git.  In this article, you will learn the basics about how to remove local and remote branches in Git.  What are Branches in Git?",
          "link": "https://www.freecodecamp.org/news/git-delete-branch-how-to-remove-a-local-or-remote-branch/",
          "publishedOn": "2021-08-26T17:00:36.000Z",
          "wordCount": 1172,
          "title": "Git Delete Branch – How to Remove a Local or Remote Branch"
        },
        {
          "id": "612439163bccf807612a6e69",
          "author": null,
          "description": "Welcome! If you speak Spanish and you want you learn JavaScript, you're in the right place. freeCodeCamp just published a free 9-hour JavaScript course for beginners. You will learn everything you need to know to get started with JavaScript, a key programming language for web development and many other applications.",
          "link": "https://www.freecodecamp.org/news/learn-javascript-in-spanish-full-course-for-beginners/",
          "publishedOn": "2021-08-26T16:35:47.000Z",
          "wordCount": 567,
          "title": "Learn JavaScript in Spanish – Full Course for Beginners"
        },
        {
          "id": "611f3dde3bccf807612a37c3",
          "author": null,
          "description": "In this article, we're going to learn how to integrate a splash screen in a Flutter app. But first, why is having a splash screen in your app essential? What is a Splash Screen?A splash screen is an initial screen that gets displayed right when the user launches the",
          "link": "https://www.freecodecamp.org/news/how-to-add-a-splash-screen-in-flutter-app/",
          "publishedOn": "2021-08-26T16:30:17.000Z",
          "wordCount": 1515,
          "title": "How to Add a Splash Screen to Your Flutter App"
        },
        {
          "id": "6123a7673bccf807612a64bf",
          "author": null,
          "description": "The Array.filter() method is arguably the most important and widely used method for iterating over an array in JavaScript. The way the filter() method works is very simple. It entails filtering out one or more items (a subset) from a larger collection of items (a superset) based on some",
          "link": "https://www.freecodecamp.org/news/javascript-array-filter-tutorial-how-to-iterate-through-elements-in-an-array/",
          "publishedOn": "2021-08-26T16:07:48.000Z",
          "wordCount": 1344,
          "title": "JavaScript Array.filter() Tutorial – How to Iterate Through Elements in an Array"
        },
        {
          "id": "61279c123bccf807612a8bda",
          "author": null,
          "description": "You can use artificial intelligence to make a Discord chat bot talk like your favorite character. It could be a Rick and Morty character, Harry Potter, Peppa Pig, or someone else. We just released a tutorial on the freeCodeCamp.org YouTube channel that will teach you how to create a",
          "link": "https://www.freecodecamp.org/news/make-a-discord-bot-that-talks-like-rick-sanchez/",
          "publishedOn": "2021-08-26T13:59:54.000Z",
          "wordCount": 5274,
          "title": "Make a Discord Chat Bot That Talks Like Rick Sanchez"
        },
        {
          "id": "612114773bccf807612a5084",
          "author": null,
          "description": "In 2012, Harvard Business Review named data science the sexiest job of the 21st century. But if you want to get a job as a data scientist, you'll need to go through a tough interview process. During data science job interviews, the interviewer will likely ask questions from different data",
          "link": "https://www.freecodecamp.org/news/23-common-data-science-interview-questions-for-beginners/",
          "publishedOn": "2021-08-25T21:39:37.000Z",
          "wordCount": 2157,
          "title": "Data Science Interview Questions for Beginners"
        },
        {
          "id": "612633433bccf807612a7bf4",
          "author": null,
          "description": "JSON stands for JavaScript Object Notation. A JSON file has .json as its extension and the data inside are represented in a key:value pair, just like a traditional JavaScript object.  JSON and objects aren't exactly the same, though. The core difference is that the key in JSON must be",
          "link": "https://www.freecodecamp.org/news/what-is-a-json-file-example-javascript-code/",
          "publishedOn": "2021-08-25T20:04:19.000Z",
          "wordCount": 1085,
          "title": "What is a JSON File? Example JavaScript Code"
        },
        {
          "id": "611e7d553bccf807612a33ec",
          "author": null,
          "description": "IntroductionAre you curious about the IoT (Internet of Things?) Have you always wanted to try to make your own robot, smart mirror, or bird feeder camera? What about building a computer for a fraction of the cost of a commercially available machine? If you said yes to any of these",
          "link": "https://www.freecodecamp.org/news/what-is-raspberry-pi-specs-and-models-2021-guide/",
          "publishedOn": "2021-08-25T16:17:20.000Z",
          "wordCount": 1210,
          "title": "What is Raspberry Pi? Specs and Models (2021 Guide)"
        },
        {
          "id": "61064a8d3306a507d1bfbff9",
          "author": null,
          "description": "JavaScript was created over 26 years ago and is currently one of the most popular programming languages. But what is JavaScript?  JavaScript is used with HTML and CSS to create dynamic and interactive web pages and mobile applications. We often call it one of the building blocks of web development.",
          "link": "https://www.freecodecamp.org/news/what-is-javascript-javascript-code-explained-in-plain-english/",
          "publishedOn": "2021-08-25T15:44:41.000Z",
          "wordCount": 1396,
          "title": "What is JavaScript? JavaScript Code Explained in Plain English"
        },
        {
          "id": "6063b8f89618b008528a9d7d",
          "author": null,
          "description": "Today we're gonna learn how to use the CSS units EM, REM, VW and VH by working through some practical examples. We'll also see how to make responsive websites with these units.  Let's start. 💖 Table of ContentsWhy learn relative units?What are REM Units?How to make responsive websites with",
          "link": "https://www.freecodecamp.org/news/learn-css-units-em-rem-vh-vw-with-code-examples/",
          "publishedOn": "2021-08-25T15:34:28.000Z",
          "wordCount": 1563,
          "title": "Learn CSS Units – Em, Rem, VH, and VW with Code Examples ✨✨"
        },
        {
          "id": "611f54d33bccf807612a38c4",
          "author": null,
          "description": "Outliers are an important part of a dataset. They can hold useful information about your data.  Outliers can give helpful insights into the data you're studying, and they can have an effect on statistical results. This can potentially help you disover inconsistencies and detect any errors in your statistical processes.",
          "link": "https://www.freecodecamp.org/news/what-is-an-outlier-definition-and-how-to-find-outliers-in-statistics/",
          "publishedOn": "2021-08-24T20:32:36.000Z",
          "wordCount": 1951,
          "title": "What is an Outlier? Definition and How to Find Outliers in Statistics"
        },
        {
          "id": "6114599172231b077cdae0ec",
          "author": null,
          "description": "You can use extensions in your browser to remove parts of a webpage you don't want to see. Removing annoyances, distractions, and irrelevant content is a great way to stay focused and remain efficient while you consume information on the internet. There are many extensions that add this functionality to",
          "link": "https://www.freecodecamp.org/news/how-to-block-content-from-web-pages-using-ublock-origin/",
          "publishedOn": "2021-08-24T19:39:53.000Z",
          "wordCount": 1136,
          "title": "How to Block Unwanted Content From Web Pages Using uBlock Origin"
        },
        {
          "id": "611255c472231b077cdac90c",
          "author": null,
          "description": "What if you could monitor your Colab, Kaggle, or AzureML Machine Learning projects on your mobile phone? You'd be able to check in on your models on the fly – even while taking a walk🚶.  If you are an ML developer, you know how training models can easily take a long",
          "link": "https://www.freecodecamp.org/news/how-to-monitor-ml-projects-on-mobile-devices/",
          "publishedOn": "2021-08-24T19:20:03.000Z",
          "wordCount": 1492,
          "title": "How to Monitor Machine Learning Projects on Your Mobile Device📱"
        },
        {
          "id": "6120b2f13bccf807612a4826",
          "author": null,
          "description": "Python has a bunch of helpful built-in functions you can use to do all sorts of stuff. And each one performs a specific task.  But did you know that Python also allows you to define your own functions?  This article will show you how to create and call your own",
          "link": "https://www.freecodecamp.org/news/python-function-examples-how-to-declare-and-invoke-with-parameters-2/",
          "publishedOn": "2021-08-24T19:04:21.000Z",
          "wordCount": 2372,
          "title": "Python Function Examples – How to Declare and Invoke with Parameters"
        },
        {
          "id": "60cf7e594dc1a607ed7b5de0",
          "author": null,
          "description": "When you're working with an application, sometimes it no longer makes sense to try to continue and improve what already exists. Instead, you need to rethink, restructure, and rebuild.  Making the decision to give up all the work you and others have put into the existing system is a difficult",
          "link": "https://www.freecodecamp.org/news/sacrificial-architecture-make-tough-decisions-to-abandon-and-rebuild-systems/",
          "publishedOn": "2021-08-24T19:02:30.000Z",
          "wordCount": 1391,
          "title": "Sacrificial Architecture – How to Make Tough Decisions to Abandon and Rebuild Systems"
        },
        {
          "id": "61225b3f3bccf807612a5aae",
          "author": null,
          "description": "Dictionaries are powerful built-in data structures in Python that store data as key-value pairs. Dictionary Comprehension can be super helpful in creating new dictionaries from existing dictionaries and iterables. In this tutorial, we'll learn how dictionary comprehensions work in Python by coding some simple examples. What is a Dictionary in",
          "link": "https://www.freecodecamp.org/news/dictionary-comprehension-in-python-explained-with-examples/",
          "publishedOn": "2021-08-24T17:34:03.000Z",
          "wordCount": 1378,
          "title": "Dictionary Comprehension in Python – Explained with Examples"
        },
        {
          "id": "612116513bccf807612a50db",
          "author": null,
          "description": "In JavaScript, you'll often need to iterate through an array collection and execute a callback method for each iteration. And there's a helpful method JS devs typically use to do this: the forEach() method. The forEach() method calls a specified callback function once for every element it iterates over inside",
          "link": "https://www.freecodecamp.org/news/javascript-array-foreach-tutorial-how-to-iterate-through-elements-in-an-array-with-map/",
          "publishedOn": "2021-08-24T17:16:41.000Z",
          "wordCount": 1664,
          "title": "JavaScript Array.forEach() Tutorial – How to Iterate Through Elements in an Array"
        },
        {
          "id": "6124d7c33bccf807612a70b0",
          "author": null,
          "description": "HTML, or Hypertext Markup Language, is a markup language for the web that defines the structure of web pages.  It is one of the most basic building blocks of every website, so it's crucial to learn if you want to have a career in web development.  In this article, I",
          "link": "https://www.freecodecamp.org/news/what-is-html-definition-and-meaning/",
          "publishedOn": "2021-08-24T16:38:12.000Z",
          "wordCount": 1688,
          "title": "What is HTML – Definition and Meaning of Hypertext Markup Language"
        },
        {
          "id": "611d6726e884de07521811e2",
          "author": null,
          "description": "It is considered a best practice to have your CSS stylesheets in an external file. So how can you link that CSS to your HTML file? Linking to an external CSS file is an important part of any HTML page boilerplate. And in this article, we'll learn how to do",
          "link": "https://www.freecodecamp.org/news/external-css-stylesheets-how-to-link-css-to-html-and-import-into-head/",
          "publishedOn": "2021-08-24T15:44:49.000Z",
          "wordCount": 735,
          "title": "External CSS Stylesheets – How to Link CSS to HTML and Import into Head"
        },
        {
          "id": "611813bf72231b077cdb01fe",
          "author": null,
          "description": "Jetpack Compose is Android's modern toolkit for building native UI. It simplifies and accelerates UI development on Android. We just released a course on the freeCodeCamp.org YouTube channel that will teach you how to create a Sudoku Android app with Kotlin and Jetpack Compose. Along the way you will",
          "link": "https://www.freecodecamp.org/news/create-an-android-app/",
          "publishedOn": "2021-08-24T15:43:51.000Z",
          "wordCount": 18594,
          "title": "Create an Android App With Kotlin and Jetpack Compose"
        },
        {
          "id": "6107c03b3306a507d1bfc55b",
          "author": null,
          "description": "In a relational database, all information should only be present once. But you might have information that's separated into different tables that's related to each other.  And you might want to put this related information together to analyse its data – that is, you might want to join all the data",
          "link": "https://www.freecodecamp.org/news/sql-join-types-inner-join-vs-outer-join-example/",
          "publishedOn": "2021-08-24T00:08:46.000Z",
          "wordCount": 1459,
          "title": "SQL Join Types – Inner Join VS Outer Join Example"
        },
        {
          "id": "6053033528094f59be257c91",
          "author": null,
          "description": "In this article, I will talk about how to get started with your first freeCodeCamp project and provide some tips along the way.  Here is what we will cover: Understanding the instructionsWhat is CodePen and how do I use it?Do I have to use CodePen or can I use",
          "link": "https://www.freecodecamp.org/news/how-to-get-started-with-the-fcc-tribute-page/",
          "publishedOn": "2021-08-23T21:22:42.000Z",
          "wordCount": 1504,
          "title": "freeCodeCamp Tribute Page Project – Tips for Getting Started"
        },
        {
          "id": "6120eac83bccf807612a4bd6",
          "author": null,
          "description": "We live in a world where things are constantly changing. So if you want to stay up to date on what's happening, you'll want a good News app.  To help you learn some cool tech and stay current, in this blog post we'll build a News Application for Android using",
          "link": "https://www.freecodecamp.org/news/build-an-android-news-app-with-react-native-and-native-base/",
          "publishedOn": "2021-08-23T18:23:27.000Z",
          "wordCount": 2974,
          "title": "How to Build an Android News App with React Native and Native Base"
        },
        {
          "id": "611a940ae884de075217f649",
          "author": null,
          "description": "As you may know, I've been a fan of Replit since way back in 2012. I used early versions of the website when I was learning to code.  For me, Replit was a place to code my solutions for Project Euler problems, and to practice my Python and JavaScript skills.",
          "link": "https://www.freecodecamp.org/news/announcing-rust-course-replit-web/",
          "publishedOn": "2021-08-23T17:03:24.000Z",
          "wordCount": 749,
          "title": "We&#x27;re Building New Courses on Rust and Python + the Replit.web Framework"
        },
        {
          "id": "6107c04a3306a507d1bfc561",
          "author": null,
          "description": "Being able to do complex queries can be really useful in SQL. In this article, we'll look at how you can use the Contains String query. SQL PatternsSQL patterns are useful for pattern matching, instead of using literal comparisons. They have a more limited syntax than RegEx, but they're more",
          "link": "https://www.freecodecamp.org/news/sql-contains-string-sql-regex-example-query/",
          "publishedOn": "2021-08-23T15:30:47.000Z",
          "wordCount": 2778,
          "title": "SQL Contains String – SQL RegEx Example Query"
        },
        {
          "id": "61064ad03306a507d1bfc001",
          "author": null,
          "description": "If you are new to programming, you might have heard of the term Front End Development. But what does that mean?  In this article, I will explain what Front End Development is, what skills you need to become a Front End Developer, and tips for landing a job.  What is",
          "link": "https://www.freecodecamp.org/news/front-end-developer-what-is-front-end-development-explained-in-plain-english/",
          "publishedOn": "2021-08-23T15:30:27.000Z",
          "wordCount": 1362,
          "title": "Front End Developer – What is Front End Development, Explained in Plain English"
        },
        {
          "id": "6116e52a72231b077cdafcf6",
          "author": null,
          "description": "When it comes to learning how to write computer programs, it can be hard to figure out where to start.  Well, look no further. We just released a full course that teaches basic programming skills in both Python and C#. This course is for absolute beginners. One of the best",
          "link": "https://www.freecodecamp.org/news/programming-for-beginners-how-to-code-with-python-and-c-sharp/",
          "publishedOn": "2021-08-23T13:24:09.000Z",
          "wordCount": 50738,
          "title": "Programming for Beginners - How to Code with Python and C#"
        },
        {
          "id": "611fd94c3bccf807612a4160",
          "author": null,
          "description": "As a React developer, I have gone through my fair share of front-end coding interviews. Recently, I had the opportunity to experience the process from the other side – as an interviewer. Here is what I've learned. Coding interview usually involve a multi-step process where interviewers assess everything from basic technical",
          "link": "https://www.freecodecamp.org/news/how-to-stand-out-during-your-react-coding-interview/",
          "publishedOn": "2021-08-20T18:20:42.000Z",
          "wordCount": 1713,
          "title": "React Coding Interview – How to Stand Out and Ace the Challenges"
        },
        {
          "id": "611bf4f8e884de0752180979",
          "author": null,
          "description": "In this tutorial, you will build an app with React. And you will learn how to create a truly reusable auto-suggestion component from scratch. This application will allow a user to search for a country in a list of countries. It will display matching suggestions below the input field for",
          "link": "https://www.freecodecamp.org/news/how-to-create-a-truly-reusable-react-component-from-scratch/",
          "publishedOn": "2021-08-20T17:54:40.000Z",
          "wordCount": 1935,
          "title": "How to Create a Truly Reusable React Component from Scratch"
        },
        {
          "id": "611f9b083bccf807612a3df0",
          "author": null,
          "description": "When you're writing HTML, you often need to insert line breaks. A line break is essential in addresses, poems, or when text exceeds the available browser width. If you don't insert your own line breaks, then the text gets formatted in an odd way.  In this tutorial, I'm going to",
          "link": "https://www.freecodecamp.org/news/html-line-break-how-to-break-a-line-with-the-html-br-tag/",
          "publishedOn": "2021-08-20T17:21:23.000Z",
          "wordCount": 960,
          "title": "HTML Line Break – How to Break a Line with the HTML &lt;br&gt; Tag"
        },
        {
          "id": "611d56d3e884de07521810f9",
          "author": null,
          "description": "At the start of this year, I published a mind map on the Data Science learning roadmap (shown below). Many people found the roadmap useful, my article got translated into different languages, and a large number of folks thanked me for publishing it. Everything was good until a few developers",
          "link": "https://www.freecodecamp.org/news/first-steps-to-learn-data-science-or-ml-after-the-roadmap/",
          "publishedOn": "2021-08-20T03:21:20.000Z",
          "wordCount": 1620,
          "title": "Programming, Math, and Statistics You Need to Know for Data Science and Machine Learning"
        },
        {
          "id": "611e8bac3bccf807612a34df",
          "author": null,
          "description": "When you code in HTML and add some text, you don’t want to leave it like that. You want to make that text look good.  And to do that, you need to change their appearance through the color and font-size properties of CSS.  In this tutorial, I will show",
          "link": "https://www.freecodecamp.org/news/html-font-style-how-to-change-text-color-and-size-with-an-html-tag/",
          "publishedOn": "2021-08-19T23:23:07.000Z",
          "wordCount": 651,
          "title": "HTML Font Style – How to Change Text Color and Size with an HTML Tag"
        },
        {
          "id": "611d436ee884de0752181044",
          "author": null,
          "description": "In CSS, the display property determines how an element looks. It is also a crucial part of the presentation of you HTML code as it has a significant impact on layouts.  In fact, to use the modern Flexbox and Grid models, you need to use the display property before you",
          "link": "https://www.freecodecamp.org/news/the-css-display-property-display-none-display-table-inline-block-and-more/",
          "publishedOn": "2021-08-19T20:47:14.000Z",
          "wordCount": 1716,
          "title": "The CSS Display Property – Display None, Display Table, Inline Block and More"
        },
        {
          "id": "611e4447e884de0752181578",
          "author": null,
          "description": "The term “lexical scope” may seem tricky to grasp at first glance. But it's helpful to understand what each word means. So this article will explain lexical scope by first examining the meaning of “lexical” and “scope”. So, let’s get it started by understanding the term “scope”. What exactly",
          "link": "https://www.freecodecamp.org/news/javascript-lexical-scope-tutorial/",
          "publishedOn": "2021-08-19T19:56:48.000Z",
          "wordCount": 1834,
          "title": "Lexical Scope in JavaScript – What Exactly Is Scope in JS?"
        },
        {
          "id": "611e3f8ee884de0752181566",
          "author": null,
          "description": "In HTML, you can't create an extra blank space after the space ( ) character with the spacebar. If you want 10 blank spaces in your HTML code and you try to add them with the spacebar, you'll only see one space in the browser.  Also, one or more of the words",
          "link": "https://www.freecodecamp.org/news/html-space-how-to-add-a-non-breaking-space-with-the-nbsp-character-entity/",
          "publishedOn": "2021-08-19T17:29:46.000Z",
          "wordCount": 1200,
          "title": "HTML Space – How to Add a Non-breaking Space with the &amp;nbsp; Character Entity"
        },
        {
          "id": "611d2ad1e884de0752180f58",
          "author": null,
          "description": "When ES6 (EmcaScript 2015) came out, it ushered in a whole new set of methods for iterating over an array. And one of the most useful is the map() method. Array.prototype.map() is a built-in array method for iterating through the elements inside an array collection in JavaScript. Think",
          "link": "https://www.freecodecamp.org/news/array-map-tutorial/",
          "publishedOn": "2021-08-19T16:16:57.000Z",
          "wordCount": 1546,
          "title": "JavaScript Array.map() Tutorial – How to Iterate Through Elements in an Array with map()"
        },
        {
          "id": "6116c31e72231b077cdafc89",
          "author": null,
          "description": "The Java Native Interface allows Java code to call native libraries written in C and C++. It is helpful when you need to do something that cannot be accomplished with Java alone. We just released a massive 28-Hour course on the freeCodeCamp.org YouTube channel that will take you from",
          "link": "https://www.freecodecamp.org/news/learn-the-java-native-interface-free-28-hour-course/",
          "publishedOn": "2021-08-19T12:43:56.000Z",
          "wordCount": 636,
          "title": "Learn the Java Native Interface - Free 28-Hour Course"
        },
        {
          "id": "61135a3472231b077cdad609",
          "author": null,
          "description": "If you're a web developer, it's important for you to have a personal portfolio website – especially when you're applying for jobs.  If you have a nice online portfolio site, you'll have a better chance of getting attention from recruiters than if you don't. Instead of sending your CV and asking",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-portfolio-site-with-nextjs-tailwindcss/",
          "publishedOn": "2021-08-18T18:02:02.000Z",
          "wordCount": 2883,
          "title": "How to Build a Portfolio Site with Next.js and TailwindCSS"
        },
        {
          "id": "610d63b33306a507d1bff79f",
          "author": null,
          "description": "You might think that software development is all about writing code, but that's not true. A huge part of the job is communicating with others. And as we all move towards more remote work, written communication is becoming increasingly important. “In their ﬁrst few years on the job, engineers spend",
          "link": "https://www.freecodecamp.org/news/writing-tips-software-developers/",
          "publishedOn": "2021-08-18T16:48:00.000Z",
          "wordCount": 1812,
          "title": "Writing Tips for Software Developers – How to Become a Better Tech Writer"
        },
        {
          "id": "611c1448e884de0752180af9",
          "author": null,
          "description": "If your screen is too bright, it can give you eye problems – especially if you sit in front of a computer coding all day.  This is because a too-bright screen can cause eye strain and fatigue, which can lead to headaches and other maladies.  If you're a regular computer user,",
          "link": "https://www.freecodecamp.org/news/how-to-change-screen-brightness-on-windows-10/",
          "publishedOn": "2021-08-17T21:03:08.000Z",
          "wordCount": 885,
          "title": "How to Change Screen Brightness on Windows 10 – Brightness Settings and How to Turn Brightness Down"
        },
        {
          "id": "611b91d2e884de07521804a5",
          "author": null,
          "description": "These days, there are a lot resources out there for learning how to code. And many of them are readily available online for free – so choosing one can be overwhelming.  But there's definitely an upside: you don't need to attend a paid bootcamp or university anymore in order to learn",
          "link": "https://www.freecodecamp.org/news/how-to-code-coding-for-beginners-and-how-to-learn-programming-for-free/",
          "publishedOn": "2021-08-17T18:06:09.000Z",
          "wordCount": 1426,
          "title": "How to Code – Coding for Beginners and How to Learn Programming for Free"
        },
        {
          "id": "610652013306a507d1bfc088",
          "author": null,
          "description": "During your programming journey, you might have heard of the term \"Open Source\". But what does that actually mean? In this article, I will explain what Open Source Software is and talk about how it differs from other types of software. I'll also discuss the positives of Open Source Software",
          "link": "https://www.freecodecamp.org/news/what-is-open-source-software-explained-in-plain-english/",
          "publishedOn": "2021-08-17T18:05:47.000Z",
          "wordCount": 1213,
          "title": "What is Open Source Software? OSS Explained in Plain English"
        },
        {
          "id": "6117d59672231b077cdaffad",
          "author": null,
          "description": "When you send a GET request to an API, you get the response data back from the server. But sometimes managing this data can be a problem. In this blog post, I will show you how to create a search filter in React. It will search for a particular term",
          "link": "https://www.freecodecamp.org/news/build-a-search-filter-using-react-and-react-hooks/",
          "publishedOn": "2021-08-17T17:56:15.000Z",
          "wordCount": 1409,
          "title": "How to Build a Search Filter using React and React Hooks"
        },
        {
          "id": "611a247372231b077cdb0d85",
          "author": null,
          "description": "When you first start to learn Python, you'll see that there are a wealth of built-in functions. You have functions like print() to print output to the console, input() to recieve input from the user, and many more.  But Python also gives you the freedom to create your own functions",
          "link": "https://www.freecodecamp.org/news/python-function-examples-how-to-declare-and-invoke-with-parameters/",
          "publishedOn": "2021-08-17T17:34:07.000Z",
          "wordCount": 1735,
          "title": "Python Function Examples – How to Declare and Invoke with Parameters"
        },
        {
          "id": "611057a03306a507d1c00a16",
          "author": null,
          "description": "In May of 2021, I wrote an article titled Coding Programs – 101 Ways to Learn to Code for Free. But since then, many more free courses have come out that should be added to the list.  In this article, I'm going to show you 152 more courses where you can",
          "link": "https://www.freecodecamp.org/news/coding-programs-coding-classes-you-can-take-for-free-online/",
          "publishedOn": "2021-08-17T17:00:03.000Z",
          "wordCount": 5039,
          "title": "Coding Programs – 152 Coding Classes You can Take for Free Online"
        },
        {
          "id": "6116b66b72231b077cdafc35",
          "author": null,
          "description": "Google has a bunch of different APIs. It can be tricky to figure out how to incorporate them into a Django project. We just released a course on the freeCodeCamp.org YouTube channel that will teach you how to build a Django app that uses multiple Google APIs. Bobby Stearman",
          "link": "https://www.freecodecamp.org/news/how-to-integrate-google-apis-with-python-django/",
          "publishedOn": "2021-08-17T13:32:18.000Z",
          "wordCount": 21004,
          "title": "How to Integrate Google APIs with Python Django"
        },
        {
          "id": "6119348e72231b077cdb0a55",
          "author": null,
          "description": "Are you preparing for coding interviews? I designed a crash course series to help you out.  I'm Lynn, a software engineer and a recent graduate from the University of Chicago. This is the second course in my Coding Interview Crash Course Series. Feel free to check out my YouTube channel,",
          "link": "https://www.freecodecamp.org/news/coding-interview-tree-traversal-crash-course-the-only-one-youll-ever-need/",
          "publishedOn": "2021-08-16T23:49:03.000Z",
          "wordCount": 1639,
          "title": "Coding Interview Tree Traversal Crash Course – The Only One You&#x27;ll Ever Need"
        },
        {
          "id": "6114c87172231b077cdae3f2",
          "author": null,
          "description": "Let's begin with a quick question: How did you land on this article and this site today?  Well, quite literally, by clicking or tapping on a link, right? That's how powerful this element is – it will get you to any part of the Internet just by clicking on a link.",
          "link": "https://www.freecodecamp.org/news/what-is-a-hyperlink-definition-for-beginners/",
          "publishedOn": "2021-08-16T23:33:49.000Z",
          "wordCount": 1475,
          "title": "What is a Hyperlink? HTML Links Explained with Examples"
        },
        {
          "id": "611a2ac772231b077cdb0e58",
          "author": null,
          "description": "If you're a JavaScript beginner, you might be struggling to understand what a promise really is.  I recently published this as a thread on Twitter and was blown away by the responses. So I decided to expand this into an introductory tutorial on JavaScript promises. I have read a lot",
          "link": "https://www.freecodecamp.org/news/what-is-promise-in-javascript-for-beginners/",
          "publishedOn": "2021-08-16T22:56:20.000Z",
          "wordCount": 1738,
          "title": "What is a Promise? JavaScript Promises for Beginners"
        },
        {
          "id": "61167e3d72231b077cdafc14",
          "author": null,
          "description": "There are many repetitive tasks that we have to do every day. And they can be a bit boring, difficult, and monotonous.  But instead of laboring away at those daily tasks, you can delegate them so someone or something else does them for you. That way, you can have more",
          "link": "https://www.freecodecamp.org/news/use-github-actions-to-automate-android-development/",
          "publishedOn": "2021-08-16T20:18:40.000Z",
          "wordCount": 2038,
          "title": "How to Use GitHub Actions to Automate Android App Development"
        },
        {
          "id": "611772ea72231b077cdafd56",
          "author": null,
          "description": "Whenever you visit a website, you'll probably click on something like a link or button.  Links take you to a certain part of the page, another page of the website, or another website entirely. Buttons, on the other hand, are usually manipulated by JavaScript events so they can trigger certain",
          "link": "https://www.freecodecamp.org/news/html-button-onclick-javascript-click-event-tutorial/",
          "publishedOn": "2021-08-16T17:58:05.000Z",
          "wordCount": 2613,
          "title": "HTML Button onclick – JavaScript Click Event Tutorial"
        },
        {
          "id": "6107bffb3306a507d1bfc543",
          "author": null,
          "description": "If you are analysing data in Excel and need to set the value of a cell conditionally, you can use an IF statement to do so. The syntax is IF(logical_test, [value_if_true], [value_if_false]), where: logical_test is an expression that evaluates to TRUE or FALSE,",
          "link": "https://www.freecodecamp.org/news/if-statement-excel-if-function-examples/",
          "publishedOn": "2021-08-16T16:10:37.000Z",
          "wordCount": 808,
          "title": "IF Statement Excel – If Function Examples"
        },
        {
          "id": "6106498a3306a507d1bfbff1",
          "author": null,
          "description": "You have just decided to learn how to code and you want to pursue a career in web development. But what exactly is web development? Where can you start learning? How much do web developers make? How do you get a job as a web developer? When I first started",
          "link": "https://www.freecodecamp.org/news/what-is-web-development-how-to-become-a-web-developer-career-path/",
          "publishedOn": "2021-08-16T16:10:01.000Z",
          "wordCount": 1538,
          "title": "What is Web Development? How to Become a Web Developer [2021 Career Path]"
        },
        {
          "id": "6114b68972231b077cdae2e6",
          "author": null,
          "description": "Node.js is one of the most popular back-end technologies out there right now. It is friendly, robust, and well-maintained and it's not going anywhere anytime soon.  To help you learn how to use it effectively, in this article we will create a simple server using Node with Babel configured",
          "link": "https://www.freecodecamp.org/news/setup-babel-in-nodejs/",
          "publishedOn": "2021-08-16T13:58:10.000Z",
          "wordCount": 1038,
          "title": "How to Setup Babel in Node.js"
        },
        {
          "id": "6040a6a7a7946308b768148c",
          "author": null,
          "description": "Are you struggling to learn to code? If you are, I want to help. So I have collected some tips from my personal experience to guide you so that you won't struggle unnecessarily again.‌‌ Why is Learning to Code Hard?Learning to code can be very hard especially for beginners.",
          "link": "https://www.freecodecamp.org/news/why-learning-to-code-is-hard-and-how-to-make-it-easier/",
          "publishedOn": "2021-08-16T13:58:01.000Z",
          "wordCount": 2566,
          "title": "Why Learning to Code is Hard – And How to Make it Easier"
        },
        {
          "id": "6114ce1f72231b077cdae411",
          "author": null,
          "description": "Have you ever noticed the \"HTTP\" or \"HTTPS\" at the beginning of a URL in your browser? Well, what is HTTP and what is HTTPS? How are they different?  In order to understand the differences, it helps to demistify to meaning of these two terms and",
          "link": "https://www.freecodecamp.org/news/what-is-https-http-vs-https-meaning-and-how-it-works/",
          "publishedOn": "2021-08-16T13:57:44.000Z",
          "wordCount": 1813,
          "title": "What is HTTPS? HTTP vs HTTPS Meaning and How it Works"
        },
        {
          "id": "610655c93306a507d1bfc0e6",
          "author": null,
          "description": "There are many benefits to coding in an online IDE or code editor. With these tools you don't need to set anything up locally, you can easily share your work, and they are often free to use. In this article, you'll learn what a code editor and an IDE are.",
          "link": "https://www.freecodecamp.org/news/javascript-online-html-css-js-code-editor-list-browser-ide-tools/",
          "publishedOn": "2021-08-12T19:31:16.000Z",
          "wordCount": 1339,
          "title": "JavaScript Online – HTML, CSS, and JS Code Editor List [Browser IDE Tools]"
        },
        {
          "id": "6115261272231b077cdaebfe",
          "author": null,
          "description": "When you're learning about web development, you probably hear about HTML and CSS pretty quickly. Well, what are these tools and how do you use them?  You can think of HTML as the structure and framing of a house. And when you want to make that structure look good, you",
          "link": "https://www.freecodecamp.org/news/html-and-css-inline-style-external-stylesheet-css-code-examples/",
          "publishedOn": "2021-08-12T18:47:27.000Z",
          "wordCount": 1580,
          "title": "HTML and CSS – Inline Style, External Stylesheet, CSS Code Examples"
        },
        {
          "id": "6107c0203306a507d1bfc551",
          "author": null,
          "description": "In this day and age, it seems like everyone is learning to code. Maybe you want to know how websites work, or you think back fondly on the old blogging platforms where you could hack together some HTML to personalize them. Or maybe you are curious to learn what all",
          "link": "https://www.freecodecamp.org/news/coding-websites-where-you-can-learn-how-to-code-for-free/",
          "publishedOn": "2021-08-12T18:11:29.000Z",
          "wordCount": 1627,
          "title": "Coding Websites Where You Can Learn How to Code for Free"
        },
        {
          "id": "610fefc23306a507d1c00896",
          "author": null,
          "description": "Authentication is an important feature and basic requirement in web applications these days. And developers spend lots of time building authentication modules for every application they create.  But this manual approach can get tiring and is a bit unproductive. This is where Laravel really shines. It, along with Laravel Breeze,",
          "link": "https://www.freecodecamp.org/news/basic-authentication-in-laravel8-using-laravel-breeze/",
          "publishedOn": "2021-08-12T15:48:12.000Z",
          "wordCount": 1088,
          "title": "Laravel Authentication Tutorial – How to Set Up Basic Auth in Laravel 8"
        },
        {
          "id": "610e15c63306a507d1bffb45",
          "author": null,
          "description": "Flutter is a Dart-based toolkit that helps you build the front end of your apps. It really shines in cross-platform mobile app development and aims to be a viable option for web and desktop as well.  In its mobile app flavor, Flutter provides many UI abstractions to build interfaces. You",
          "link": "https://www.freecodecamp.org/news/how-to-install-and-setup-flutter-on-ubuntu/",
          "publishedOn": "2021-08-12T15:43:09.000Z",
          "wordCount": 2173,
          "title": "How to Install and Set Up Flutter on Ubuntu 16.04+"
        },
        {
          "id": "6112e3c972231b077cdad299",
          "author": null,
          "description": "Clean Architecture is a term coined by Robert C. Martin. The main idea is that entities and use cases are independent of frameworks, UI, the database, and external services. A Clean Architecture style has a positive effect on maintainability because: We can test domain entities and use cases without a",
          "link": "https://www.freecodecamp.org/news/modern-clean-architecture/",
          "publishedOn": "2021-08-12T15:28:31.000Z",
          "wordCount": 2243,
          "title": "How to Build Modern Clean Architecture"
        },
        {
          "id": "6113ee6272231b077cdadbd3",
          "author": null,
          "description": "Forms are one of the most important parts of the web. Without them, there wouldn't be an easy way to collect data, search for resources, or sign up to receive valuable information.  You can embed forms on websites with the HTML form element. Inside the form element, several inputs are",
          "link": "https://www.freecodecamp.org/news/html-form-input-type-and-submit-button-example/",
          "publishedOn": "2021-08-12T15:17:38.000Z",
          "wordCount": 1950,
          "title": "HTML Form – Input Type and Submit Button Example"
        },
        {
          "id": "610aec303306a507d1bfdf07",
          "author": null,
          "description": "FastAPI makes it quicker and easier to develop APIs with Python. We just published a crash course on the freeCodeCamp.org YouTube channel that will teach you how to use FastAPI.  Tomi Tokko developed this course. Tomi has made many popular courses both on his own channel and the freeCodeCamp",
          "link": "https://www.freecodecamp.org/news/fastapi-helps-you-develop-apis-quickly/",
          "publishedOn": "2021-08-12T13:07:37.000Z",
          "wordCount": 8996,
          "title": "FastAPI Course – Code APIs Quickly"
        },
        {
          "id": "61025c793306a507d1bfad64",
          "author": null,
          "description": "I recently had the chance to teach high school students how to code. There are not that many beginner-friendly tutorials on algorithms coded in JavaScript which is the language they were learning. So I decided to make one. In this article, I will try my best to explain some core",
          "link": "https://www.freecodecamp.org/news/binary-tree-algorithms-for-javascript-beginners/",
          "publishedOn": "2021-08-11T23:50:28.000Z",
          "wordCount": 1356,
          "title": "Binary Search Tree Algorithms for JavaScript Beginners"
        },
        {
          "id": "610d4a303306a507d1bff2ea",
          "author": null,
          "description": "One of the end goals of a React Native project is to have a minimal amount of platform-specific logic and code. Most APIs can be built so the platform-specific code is abstracted away by the framework. This gives you a single way to interact with them and easily create cross-platform",
          "link": "https://www.freecodecamp.org/news/how-to-implement-ios-components-apis/",
          "publishedOn": "2021-08-11T23:31:34.000Z",
          "wordCount": 1442,
          "title": "How to Implement iOS-Specific Components and APIs"
        },
        {
          "id": "611091a63306a507d1c00a1c",
          "author": null,
          "description": "Podcasts are a great way to consume digital information. They've become quite popular because you can listen to them anywhere, any time.  Podcasts deliver educational, entertaining, and engaging content on all kinds of topics – tech topics included. The hosts and their guests talk and share ideas, each in their own",
          "link": "https://www.freecodecamp.org/news/best-podcasts-for-flutter-developers/",
          "publishedOn": "2021-08-11T20:51:56.000Z",
          "wordCount": 750,
          "title": "Best Podcasts for Flutter Developers"
        },
        {
          "id": "611126603306a507d1c00fd2",
          "author": null,
          "description": "Imagine that you're interviewing for your dream job and the interviewer drops this question for you: “So can you distinguish between a static web page and a dynamic web page?” What would your reaction be? If you don’t know the answer to that question, or are struggling to think",
          "link": "https://www.freecodecamp.org/news/static-vs-dynamic-web-pages/",
          "publishedOn": "2021-08-11T19:54:10.000Z",
          "wordCount": 1413,
          "title": "Static vs Dynamic Web Pages – What&#x27;s the Difference?"
        },
        {
          "id": "610eb7f03306a507d1c001f5",
          "author": null,
          "description": "We use props to pass information/data from a parent component to child components. In this article, I will explain everything you need to know about props and why you should use props in Vue.js. Here's a brief outline of what we'll cover in this guide: What are props",
          "link": "https://www.freecodecamp.org/news/how-to-use-props-in-vuejs/",
          "publishedOn": "2021-08-11T19:51:52.000Z",
          "wordCount": 1221,
          "title": "How to Use Props in Vue.js"
        },
        {
          "id": "6112913c72231b077cdacc4d",
          "author": null,
          "description": "In HTML, you use the <img> tag to add images to websites. It is an inline and empty element, which means that it doesn't start on a new line and doesn't take a closing tag (unlike the paragraph (<p>) tag, for instance).  The <img>",
          "link": "https://www.freecodecamp.org/news/img-html-image-tag-tutorial/",
          "publishedOn": "2021-08-11T15:28:58.000Z",
          "wordCount": 1466,
          "title": "&lt;img&gt; HTML – Image Tag Tutorial"
        },
        {
          "id": "610ee8443306a507d1c00249",
          "author": null,
          "description": "Lately I've been seeing many tweets and articles about Prisma. It's a modern ORM (Object-Relational-Mapping tool) that works with Node.jsand TypeScript. Yes, this library will help you build and manage your Node.js database – and it's compatible with TypeScript! It will generate all the types of your entities automatically.",
          "link": "https://www.freecodecamp.org/news/build-nodejs-database-using-prisma-orm/",
          "publishedOn": "2021-08-11T15:24:42.000Z",
          "wordCount": 1997,
          "title": "How to Build a Node.js Database using Prisma and SQLite"
        },
        {
          "id": "610d8f383306a507d1bff9c3",
          "author": null,
          "description": "OpenGL can be used to create complex 2D and 3D graphics effects.  We just released an advanced OpenGL course on the freeCodeCamp.org YouTube channel. Victor Gordan created this course. Before this course he created one of the most popular OpenGL course on YouTube. Now, he will help you take",
          "link": "https://www.freecodecamp.org/news/create-complex-graphics-with-opengl/",
          "publishedOn": "2021-08-11T12:40:12.000Z",
          "wordCount": 8532,
          "title": "Create Complex Graphics with OpenGL"
        },
        {
          "id": "610e151e3306a507d1bffb32",
          "author": null,
          "description": "JavaScript has two awesome data structures that help you write clean and efficient code. But handling them can get messy sometimes. In this blog, I am going to show you how to handle destructuring in arrays and objects in JavaScript. We'll also learn how to use the spread operator as",
          "link": "https://www.freecodecamp.org/news/javascript-destructuring-and-spread-operator-explained/",
          "publishedOn": "2021-08-10T21:46:07.000Z",
          "wordCount": 1444,
          "title": "JavaScript Destructuring and the Spread Operator – Explained with Example Code"
        },
        {
          "id": "610d11273306a507d1bfeffe",
          "author": null,
          "description": "If you are learning web development, you will come across terms like HTML, CSS, and JavaScript. These are often called the building blocks of the Web.  These three tools dominate web development. Every library or tool seems to be centered around HTML, CSS, and JS. So if you want to",
          "link": "https://www.freecodecamp.org/news/html-css-and-javascript-explained-for-beginners/",
          "publishedOn": "2021-08-10T21:02:00.000Z",
          "wordCount": 2257,
          "title": "Learn Web Development Basics – HTML, CSS, and JavaScript Explained for Beginners"
        },
        {
          "id": "610642353306a507d1bfbfe4",
          "author": null,
          "description": "Python is a great programming language to learn and you can use it in a variety of areas in software development. You can use Python for web development, data analysis, machine learning, artificial intelligence, and more.  With the vast amount of resources to choose from, sometimes it is hard to",
          "link": "https://www.freecodecamp.org/news/the-best-way-to-learn-python-python-programming-tutorial-for-beginners/",
          "publishedOn": "2021-08-10T20:37:56.000Z",
          "wordCount": 1163,
          "title": "The Best Way to Learn Python – Python Programming Tutorial for Beginners"
        },
        {
          "id": "6108f8453306a507d1bfce17",
          "author": null,
          "description": "When coding in Python, have you ever had to check if any item or all items in an iterable evaluate to True? The next time you need to do so, be sure to use the nifty functions any() and all(). In this tutorial, we'll learn about Python's any() and all(",
          "link": "https://www.freecodecamp.org/news/python-any-and-all-functions-explained-with-examples/",
          "publishedOn": "2021-08-10T20:26:25.000Z",
          "wordCount": 1541,
          "title": "Python any() and all() Functions – Explained with Examples"
        },
        {
          "id": "61122afb72231b077cdac810",
          "author": null,
          "description": "When you're starting your coding journey, one of the most exciting – and at times overwhelming – things about it is just how much there is to learn.  You'll discover different languages, frameworks, libraries, inventions and conventions.  One technology often requires knowledge of another one, and everything seems to be interconnected and",
          "link": "https://www.freecodecamp.org/news/what-is-coding/",
          "publishedOn": "2021-08-10T19:54:45.000Z",
          "wordCount": 2455,
          "title": "What is Coding? Computer Coding Definition"
        },
        {
          "id": "610ef4fc3306a507d1c00257",
          "author": null,
          "description": "One of the best things about VS Code is the rich library of extensions you can use to speed up your coding and make your life easier.  Some of these extensions are paid, but there are tons of quality options that are available for free in the VS Code Marketplace.",
          "link": "https://www.freecodecamp.org/news/10-vscode-extensions-to-increase-productivity/",
          "publishedOn": "2021-08-10T18:32:00.000Z",
          "wordCount": 928,
          "title": "10 VS Code Extensions to Increase Your Productivity"
        },
        {
          "id": "610ce4f83306a507d1bfeba5",
          "author": null,
          "description": "Web scraping is the process of extracting specific data from the internet automatically. It has many use cases, like getting data for a machine learning project, creating a price comparison tool, or any other innovative idea that requires an immense amount of data. While you can theoretically do data extraction",
          "link": "https://www.freecodecamp.org/news/how-to-scrape-websites-with-python-2/",
          "publishedOn": "2021-08-10T17:42:52.000Z",
          "wordCount": 2677,
          "title": "Python Web Scraping Tutorial – How to Scrape Data From Any Website with Python"
        },
        {
          "id": "5fff3e3798be260817e495df",
          "author": null,
          "description": "Distributed Denial of Service (DDoS) attacks aim to take an organization or service offline and originate from multiple, distributed hosts.  The difficult part of defending against DDoS attacks is that the hosts are distributed – if it were a single host or small group, you could easily block the traffic with",
          "link": "https://www.freecodecamp.org/news/protect-against-ddos-attacks/",
          "publishedOn": "2021-08-10T17:36:54.000Z",
          "wordCount": 1641,
          "title": "How to Protect Against DDoS Attacks"
        },
        {
          "id": "60f7aef31d2b080797b80a01",
          "author": null,
          "description": "Formatting a string is something you'll do all the time when you're coding in Python. For every variable, tuple, and dictionary and the logic that we define, we eventually have to either print or display it in some form.  And each of these, without exception, require us to format the",
          "link": "https://www.freecodecamp.org/news/how-to-format-a-string-in-python/",
          "publishedOn": "2021-08-10T17:19:00.000Z",
          "wordCount": 1636,
          "title": "How to Format a String in Python"
        },
        {
          "id": "610abfc03306a507d1bfde47",
          "author": null,
          "description": "Big O notation is an important tools for computer scientists to analyze the cost of an algorithm. Most software engineers should have an understanding of it. We just released a course on the freeCodeCamp.org YouTube channel that will help you understand Big O Notation. Georgio Tunson, aka selikapro, created",
          "link": "https://www.freecodecamp.org/news/learn-big-o-notation/",
          "publishedOn": "2021-08-10T13:12:34.000Z",
          "wordCount": 17118,
          "title": "Learn Big O Notation"
        },
        {
          "id": "610a44f83306a507d1bfd44e",
          "author": null,
          "description": "SQL stands for Structured Query Language and is a language that you use to manage data in databases. SQL consists of commands and declarative statements that act as instructions to the database so it can perform tasks.  You can use SQL commands to create a table in a database, to",
          "link": "https://www.freecodecamp.org/news/learn-sql-queries-database-query-tutorial-for-beginners/",
          "publishedOn": "2021-08-10T00:05:46.000Z",
          "wordCount": 2043,
          "title": "Learn SQL Queries – Database Query Tutorial for Beginners"
        },
        {
          "id": "610657e03306a507d1bfc108",
          "author": null,
          "description": "There will be times where you will want to write commands that handle different decisions in your code.  For example, if you are coding a bot, you can have it respond with different messages based on a set of commands it receives.  In this article, I will explain what an",
          "link": "https://www.freecodecamp.org/news/javascript-if-else-and-if-then-js-conditional-statements/",
          "publishedOn": "2021-08-09T23:21:21.000Z",
          "wordCount": 1482,
          "title": "JavaScript If-Else and If-Then – JS Conditional Statements"
        },
        {
          "id": "610e257e3306a507d1bffc96",
          "author": null,
          "description": "Google Colab and VS Code are two popular editor tools that many Python developers use. They're great for developing efficient tech solutions or systems especially in the areas of Machine Learning and Data Science. If you're a Python developer or data scientist, you might already know how to use Google",
          "link": "https://www.freecodecamp.org/news/how-to-use-google-colab-with-vs-code/",
          "publishedOn": "2021-08-09T22:24:53.000Z",
          "wordCount": 841,
          "title": "How to Use Google Colab with VS Code"
        },
        {
          "id": "610d55bf3306a507d1bff496",
          "author": null,
          "description": "Pure functions and impure functions are two programming terms you will often see in functional programming. Once core difference between these two types of functions is whether or not they have side effects. In this article, you will learn what side effects are and we'll discuss the differences between pure",
          "link": "https://www.freecodecamp.org/news/pure-function-vs-impure-function/",
          "publishedOn": "2021-08-09T21:06:46.000Z",
          "wordCount": 1278,
          "title": "Pure vs Impure Functions in Functional Programming – What&#x27;s the Difference?"
        },
        {
          "id": "5fff3dd898be260817e495cf",
          "author": null,
          "description": "Cross Site Scripting is the second most prevalent issue in the Open Source Foundation for Application Security (OWASP) top 10 – it's found in roughly 2/3 of all applications.  While automated tools can find some of these problems, there are also automated tools designed to detect and exploit these vulnerabilities.",
          "link": "https://www.freecodecamp.org/news/cross-site-scripting-what-is-xss/",
          "publishedOn": "2021-08-09T17:27:40.000Z",
          "wordCount": 1419,
          "title": "What is Cross Site Scripting? How to Protect against XSS Attacks"
        },
        {
          "id": "610d9b6a3306a507d1bff9f0",
          "author": null,
          "description": "You can use HTML's <a> tag to link to different parts of a website, to another web page, or to a separate website entirely.  By default, it is underlined and given a bluish color, but you can override these style defaults with CSS (which a lot of people",
          "link": "https://www.freecodecamp.org/news/html-a-tag-anchor-link-href-example/",
          "publishedOn": "2021-08-09T15:15:04.000Z",
          "wordCount": 1172,
          "title": "HTML &lt;a&gt; Tag – Anchor Link HREF Example"
        },
        {
          "id": "610682ee3306a507d1bfc210",
          "author": null,
          "description": "You have created your database and your tables, and after all this work, you notice that you need to add or rename a column. Well, you can use the ALTER TABLE statement to do so. Just keep in mind that you need to be really careful when you do this.",
          "link": "https://www.freecodecamp.org/news/alter-table-in-sql-how-to-add-a-column-or-rename-a-column-in-sql/",
          "publishedOn": "2021-08-09T15:14:48.000Z",
          "wordCount": 1057,
          "title": "Alter Table in SQL – How to Add a Column or Rename a Column in SQL"
        },
        {
          "id": "610aabc23306a507d1bfdc7d",
          "author": null,
          "description": "Learn how to pass the Google Cloud Digital Leader Certification with this free 6-hour course! This is a significant milestone for free cloud certifications courses, since we now have on freeCodeCamp all the three major cloud service providers (AWS, Azure and GCP). What is the Google Cloud Certified Cloud Digital",
          "link": "https://www.freecodecamp.org/news/google-cloud-digital-leader-course/",
          "publishedOn": "2021-08-09T13:02:15.000Z",
          "wordCount": 561,
          "title": "Google Cloud Digital Leader Certification Study Course – Pass the Exam With This Free 6 Hour Course"
        }
      ]
    },
    {
      "title": "Nicolas Hoizey - Articles",
      "feedUrl": "https://nicolas-hoizey.com/feeds/articles.xml",
      "siteUrl": "https://nicolas-hoizey.com/feeds/articles.xml",
      "articles": []
    },
    {
      "title": "Nicolas Hoizey - Links",
      "feedUrl": "https://nicolas-hoizey.com/feeds/links.xml",
      "siteUrl": "https://nicolas-hoizey.com/feeds/links.xml",
      "articles": [
        {
          "id": "https://nicolas-hoizey.com/links/2021/09/02/does-shadow-dom-improve-style-performance-/",
          "author": null,
          "description": "https://nolanlawson.com/2021/08/15/does-shadow-dom-improve-style-performance/\n        \n\n        \nThis article is about style performance improvement with Shadow DOM, but it also contains a useful comparison of selector performance between ids, classes and data attributes:\nID and class selectors are fast enough that actually it doesn’t matter much whether shadow DOM is used or not – in fact, they’re slightly faster without shadow DOM. This indicates that systems like Svelte, CSS Modules, or good old-fashioned BEM are using the best approach performance-wise.\nThis also indicates that using attributes for style encapsulation does not scale well compared to classes. So perhaps scoping systems like Vue would be better off switching to classes.",
          "link": "https://nicolas-hoizey.com/links/2021/09/02/does-shadow-dom-improve-style-performance-/",
          "publishedOn": "2021-09-02T09:43:55.000Z",
          "wordCount": 185,
          "title": "Does shadow DOM improve style performance?"
        },
        {
          "id": "https://nicolas-hoizey.com/links/2021/08/13/mastodon-fediverse-for-beginners/",
          "author": null,
          "description": "https://write.wien.rocks/paula/mastodon-and-fediverse-for-beginners\n        \n\n        \nHere's a good introduction to the Fediverse from Paula, with details about Mastodon and Pixelfed.\nImagine Twitter, Facebook, Instagram & Co were all part of one giant network. That's basically what the fediverse is, except the parts are less well known, free & decentralized alternatives to those.\nE.g. Mastodon is like Twitter, Friendica is like Facebook, Pixelfed is like Instagram and there are many more.\nIf you e.g. have a Mastodon account you can follow accounts on Friendica or Pixelfed and you might not even notice, that they are not Mastodon accounts.\nYou can find me in these too:\nMastodon\nPixelfed",
          "link": "https://nicolas-hoizey.com/links/2021/08/13/mastodon-fediverse-for-beginners/",
          "publishedOn": "2021-08-13T13:20:44.000Z",
          "wordCount": 173,
          "title": "Mastodon & Fediverse for Beginners"
        }
      ]
    },
    {
      "title": "Kitty Giraudel",
      "feedUrl": "https://kittygiraudel.com/rss/index.xml",
      "siteUrl": "https://kittygiraudel.com",
      "articles": [
        {
          "id": "https://kittygiraudel.com/2021/08/24/from-cra-to-next/",
          "author": null,
          "description": "I recently moved a significant codebase from Create-React-App (CRA for short) to Next and thought I would share my experience, because believe me or not, it was quite a journey (and not necessarily a pleasant one).\nThere are plenty reasons why you might want to move to Next from a CRA app. It provides server-side rendering (SSR), and even incremental static regeneration (ISR) when hosted on Vercel. It’s an encompassing framework with built-in routing, image optimization, development environment, and more.\nThis post is a high-level walkthrough of things to deal with to finalized the migration from CRA to Next. Here’s what we’ll cover:\nHTML boilerplate\nHead content\nRouting\nCode splitting\nStyling\nCSR/SSR\nLinting\nRunning both systems\nWrapping up\nHTML boilerplate\nCRA uses an index.html file in …",
          "link": "https://kittygiraudel.com/2021/08/24/from-cra-to-next/",
          "publishedOn": "2021-08-24T00:00:00.000Z",
          "wordCount": 1521,
          "title": "From Create-React-App to Next"
        },
        {
          "id": "https://kittygiraudel.com/2021/08/23/shadow-roots-and-inheritance/",
          "author": null,
          "description": "I encountered a bit of a HTML/CSS oddity the other day, and was a little stumped as to what was happening so I thought I’d share what I learnt in case that helps other people stumbling across the same thing.\nThe problem\nTake a basic <details> and <summary> combo:\n<details>\n  <summary>System Requirements</summary>\n  <p>\n    Requires a computer running an operating system. The computer must have some\n    memory and ideally some kind of long-term storage. An input device as well\n    as some form of output device is recommended.\n  </p>\n</details>\nNow, consider the following inocuous CSS:\nhtml {\n  box-sizing: border-box;\n}\n* {\n  box-sizing: inherit;\n}\nWhile there is nothing too ground-breaking here, what’s interesting to note is that anything within the <details> element will have a content-box…",
          "link": "https://kittygiraudel.com/2021/08/23/shadow-roots-and-inheritance/",
          "publishedOn": "2021-08-23T00:00:00.000Z",
          "wordCount": 636,
          "title": "Shadow Roots and Inheritance"
        },
        {
          "id": "https://kittygiraudel.com/2021/08/20/accessibility-from-the-ground-up/",
          "author": null,
          "description": "So you are starting or restarting that website or webapp from scratch, and you want to do things well. You know about accessibility, you know it’s important, and no one up the food chain (all them bosses) is challenging this (or invested enough to care). That’s great news! Let’s make that project A C C E S S I B L E. ✨\nThat’s pretty daunting though. It can be tricky to know how to even get started with such a big task. Fear not! In this piece, we’re going to see how to get started with accessibility so it’s considered all throughout the development lifecycle of the project instead of at the end like usual.\nLearn what accessibility is\nWrite documentation\nHave a checklist\nAutomate what you can\nCentralize logic\nRaise awareness\nLearn what accessibility is\nI wrote about what accessibility is as…",
          "link": "https://kittygiraudel.com/2021/08/20/accessibility-from-the-ground-up/",
          "publishedOn": "2021-08-20T00:00:00.000Z",
          "wordCount": 1500,
          "title": "Accessibility from the Ground Up"
        },
        {
          "id": "https://css-tricks.com/responsible-markdown-in-next-js/",
          "author": null,
          "description": "Markdown truly is a great format. It’s close enough to plain text so that anyone can quickly learn it, and it’s structured enough that it can be parsed",
          "link": "https://css-tricks.com/responsible-markdown-in-next-js/",
          "publishedOn": "2021-08-10T00:00:00.000Z",
          "wordCount": 1590,
          "title": "Responsible Markdown in Next.js"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}